doc/org-mode/tutorial.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Introduction to Nitrogen</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-12-06 08:54:01 EST"/>
<meta name="author" content="Rusty Klophaus"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="tutorial.css" />
</head>
<body>
<div id="content">

<h1 class="title">Introduction to Nitrogen</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Welcome </a></li>
<li><a href="#sec-2">2 Main Agenda Slide </a>
<ul>
<li><a href="#sec-2_1">2.1 Agenda </a></li>
</ul>
</li>
<li><a href="#sec-3">3 PART 1 AGENDA </a>
<ul>
<li><a href="#sec-3_1">3.1 Install &amp; Run Nitrogen </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Install Nitrogen </a>
<ul>
<li><a href="#sec-4_1">4.1 Install Nitrogen </a>
<ul>
<li><a href="#sec-4_1_1">4.1.1 If you <b>don't</b> have Erlang Installed: </a></li>
<li><a href="#sec-4_1_2">4.1.2 If you <b>do</b> have Erlang installed: </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Start the Website in Console Mode </a>
<ul>
<li><a href="#sec-5_1">5.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-5_1_1">5.1.1 Start Up </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 Stop the Website </a>
<ul>
<li><a href="#sec-6_1">6.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-6_1_1">6.1.1 Shut Down </a></li>
<li><a href="#sec-6_1_2">6.1.2 View the Directory </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-7">7 Anatomy of a Nitrogen Project </a>
<ul>
<li><a href="#sec-7_1">7.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-7_1_1">7.1.1 Anatomy of a Nitrogen Project </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 Anatomy of the site/ Directory </a>
<ul>
<li><a href="#sec-8_1">8.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-8_1_1">8.1.1 The <code>site/</code> Directory </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-9">9 Anatomy of the site/src Directory </a>
<ul>
<li><a href="#sec-9_1">9.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-9_1_1">9.1.1 The <code>site/src/</code> Directory </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-10">10 Exercise: Modify a Nitrogen Page </a>
<ul>
<li><a href="#sec-10_1">10.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-10_1_1">10.1.1 Exercise: Modify Your First Page </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-11">11 Exercise: Compile in Different Ways </a>
<ul>
<li><a href="#sec-11_1">11.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-11_1_1">11.1.1 Exercise: Compile in a Different Way </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-12">12 Exercise: Debugging </a>
<ul>
<li><a href="#sec-12_1">12.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-12_1_1">12.1.1 Debug Statements </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-13">13 Emacs Mode </a>
<ul>
<li><a href="#sec-13_1">13.1 Install &amp; Run Nitrogen </a>
<ul>
<li><a href="#sec-13_1_1">13.1.1 Emacs <code>nitrogen-mode</code> </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-14">14 PART 2 AGENDA </a>
<ul>
<li><a href="#sec-14_1">14.1 Nitrogen Pages </a></li>
</ul>
</li>
<li><a href="#sec-15">15 What is a Nitrogen Page? </a>
<ul>
<li><a href="#sec-15_1">15.1 Nitrogen Pages </a>
<ul>
<li><a href="#sec-15_1_1">15.1.1 What is a Nitrogen Page </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-16">16 Dynamic Routes Explained </a>
<ul>
<li><a href="#sec-16_1">16.1 Nitrogen Pages </a>
<ul>
<li><a href="#sec-16_1_1">16.1.1 Dynamic Routing Explained </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-17">17 Creating a New Page </a>
<ul>
<li><a href="#sec-17_1">17.1 Nitrogen Pages </a>
<ul>
<li><a href="#sec-17_1_1">17.1.1 Exercise: Create a New Page </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-18">18 How is a Page Rendered (Simple Version) </a>
<ul>
<li><a href="#sec-18_1">18.1 Nitrogen Pages </a>
<ul>
<li><a href="#sec-18_1_1">18.1.1 How is a Page Rendered? </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-19">19 Anatomy of a Template </a>
<ul>
<li><a href="#sec-19_1">19.1 Nitrogen Pages </a>
<ul>
<li><a href="#sec-19_1_1">19.1.1 Anatomy of a Template </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-20">20 Experimenting With Templates </a>
<ul>
<li><a href="#sec-20_1">20.1 Nitrogen Pages </a>
<ul>
<li><a href="#sec-20_1_1">20.1.1 Experimenting With Templates </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-21">21 PART 3 AGENDA </a>
<ul>
<li><a href="#sec-21_1">21.1 Nitrogen Elements </a></li>
</ul>
</li>
<li><a href="#sec-22">22 What is a Nitrogen Element? </a>
<ul>
<li><a href="#sec-22_1">22.1 Nitrogen Elements </a>
<ul>
<li><a href="#sec-22_1_1">22.1.1 What is a Nitrogen Element? </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-23">23 What is a Nitrogen Element? </a>
<ul>
<li><a href="#sec-23_1">23.1 Nitrogen Elements </a>
<ul>
<li><a href="#sec-23_1_1">23.1.1 What is a Nitrogen Element? </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-24">24 Nitrogen Element Properties </a>
<ul>
<li><a href="#sec-24_1">24.1 Nitrogen Elements </a>
<ul>
<li><a href="#sec-24_1_1">24.1.1 Why Nitrogen Elements? </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-25">25 Nitrogen Element Examples </a>
<ul>
<li><a href="#sec-25_1">25.1 Nitrogen Elements </a>
<ul>
<li><a href="#sec-25_1_1">25.1.1 Nitrogen Element Examples </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-26">26 Nested Elements </a>
<ul>
<li><a href="#sec-26_1">26.1 Nitrogen Elements </a>
<ul>
<li><a href="#sec-26_1_1">26.1.1 Nested Elements </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-27">27 PART 4 AGENDA </a>
<ul>
<li><a href="#sec-27_1">27.1 Nitrogen Actions </a></li>
</ul>
</li>
<li><a href="#sec-28">28 What is a Nitrogen Action? </a>
<ul>
<li><a href="#sec-28_1">28.1 Nitrogen Actions </a>
<ul>
<li><a href="#sec-28_1_1">28.1.1 What is a Nitrogen Action? </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-29">29 What is a Nitrogen Action? </a>
<ul>
<li><a href="#sec-29_1">29.1 Nitrogen Actions </a>
<ul>
<li><a href="#sec-29_1_1">29.1.1 What is a Nitrogen Action? </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-30">30 Wiring an Action </a>
<ul>
<li><a href="#sec-30_1">30.1 Nitrogen Actions </a>
<ul>
<li><a href="#sec-30_1_1">30.1.1 Wiring an Action </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-31">31 Conditional Actions with <code>#event{}</code> </a>
<ul>
<li><a href="#sec-31_1">31.1 Nitrogen Actions </a>
<ul>
<li><a href="#sec-31_1_1">31.1.1 Conditional Actions with <code>#event{}</code> </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-32">32 Triggers and Targets </a>
<ul>
<li><a href="#sec-32_1">32.1 Nitrogen Actions </a>
<ul>
<li><a href="#sec-32_1_1">32.1.1 Triggers and Targets </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-33">33 Triggers and Targets </a>
<ul>
<li><a href="#sec-33_1">33.1 Nitrogen Actions </a>
<ul>
<li><a href="#sec-33_1_1">33.1.1 Triggers and Targets </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-34">34 Quick Review </a>
<ul>
<li><a href="#sec-34_1">34.1 Nitrogen Actions </a>
<ul>
<li><a href="#sec-34_1_1">34.1.1 Quick Review </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-35">35 PART 5 AGENDA </a>
<ul>
<li><a href="#sec-35_1">35.1 Nitrogen Events </a></li>
</ul>
</li>
<li><a href="#sec-36">36 What is a Postback? </a>
<ul>
<li><a href="#sec-36_1">36.1 Nitrogen Events </a>
<ul>
<li><a href="#sec-36_1_1">36.1.1 What is a Postback? </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-37">37 Your First Postback </a>
<ul>
<li><a href="#sec-37_1">37.1 Nitrogen Events </a>
<ul>
<li><a href="#sec-37_1_1">37.1.1 Your First Postback </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-38">38 Postback Shortcuts </a>
<ul>
<li><a href="#sec-38_1">38.1 Nitrogen Events </a>
<ul>
<li><a href="#sec-38_1_1">38.1.1 Postback Shortcuts </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-39">39 Postback Shortcuts </a>
<ul>
<li><a href="#sec-39_1">39.1 Nitrogen Events </a>
<ul>
<li><a href="#sec-39_1_1">39.1.1 Postback Shortcuts </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-40">40 More Event Examples </a>
<ul>
<li><a href="#sec-40_1">40.1 Nitrogen Events </a>
<ul>
<li><a href="#sec-40_1_1">40.1.1 More Event Examples </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-41">41 More Event Examples </a>
<ul>
<li><a href="#sec-41_1">41.1 Nitrogen Events </a>
<ul>
<li><a href="#sec-41_1_1">41.1.1 More Event Examples </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-42">42 Modifying Elements </a>
<ul>
<li><a href="#sec-42_1">42.1 Nitrogen Events </a>
<ul>
<li><a href="#sec-42_1_1">42.1.1 Modifying Elements </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-43">43 More Page Manipulation </a>
<ul>
<li><a href="#sec-43_1">43.1 Nitrogen Events </a>
<ul>
<li><a href="#sec-43_1_1">43.1.1 More Page Manipulation </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-44">44 PART 6 AGENDA </a>
<ul>
<li><a href="#sec-44_1">44.1 Remembering State </a></li>
</ul>
</li>
<li><a href="#sec-45">45 Page State vs. Session State </a>
<ul>
<li><a href="#sec-45_1">45.1 Remembering State </a>
<ul>
<li><a href="#sec-45_1_1">45.1.1 Page State vs. Session State </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-46">46 Page State </a>
<ul>
<li><a href="#sec-46_1">46.1 Remembering State </a>
<ul>
<li><a href="#sec-46_1_1">46.1.1 Page State </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-47">47 Page State </a>
<ul>
<li><a href="#sec-47_1">47.1 Remembering State </a>
<ul>
<li><a href="#sec-47_1_1">47.1.1 Page State </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-48">48 Session State </a>
<ul>
<li><a href="#sec-48_1">48.1 Remembering State </a>
<ul>
<li><a href="#sec-48_1_1">48.1.1 Session State </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-49">49 Session State </a>
<ul>
<li><a href="#sec-49_1">49.1 Remembering State </a>
<ul>
<li><a href="#sec-49_1_1">49.1.1 Session State </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-50">50 PART 7 AGENDA </a>
<ul>
<li><a href="#sec-50_1">50.1 Security </a></li>
</ul>
</li>
<li><a href="#sec-51">51 Limiting Access to a Page </a>
<ul>
<li><a href="#sec-51_1">51.1 Security </a>
<ul>
<li><a href="#sec-51_1_1">51.1.1 Limiting Access to a Page </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-52">52 Authentication and Authorization Functions </a>
<ul>
<li><a href="#sec-52_1">52.1 Security </a>
<ul>
<li><a href="#sec-52_1_1">52.1.1 Authentication and Authorization Functions </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-53">53 Page Redirection Functions </a>
<ul>
<li><a href="#sec-53_1">53.1 Security </a>
<ul>
<li><a href="#sec-53_1_1">53.1.1 Page Redirection Functions </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-54">54 Creating a Secure Page - Step 1 </a>
<ul>
<li><a href="#sec-54_1">54.1 Security </a>
<ul>
<li><a href="#sec-54_1_1">54.1.1 Creating a Secure Page - Step 1 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-55">55 Creating a Secure Page - Step 2 </a>
<ul>
<li><a href="#sec-55_1">55.1 Security </a>
<ul>
<li><a href="#sec-55_1_1">55.1.1 Creating a Secure Page - Step 2 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-56">56 Creating a Secure Page - Step 3 </a>
<ul>
<li><a href="#sec-56_1">56.1 Security </a>
<ul>
<li><a href="#sec-56_1_1">56.1.1 Creating a Secure Page - Step 3 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-57">57 Creating a Secure Page - Step 4 </a>
<ul>
<li><a href="#sec-57_1">57.1 Security </a>
<ul>
<li><a href="#sec-57_1_1">57.1.1 Creating a Secure Page - Step 4 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-58">58 PART 8 AGENDA </a>
<ul>
<li><a href="#sec-58_1">58.1 Validation </a></li>
</ul>
</li>
<li><a href="#sec-59">59 Overview of Nitrogen Validation </a>
<ul>
<li><a href="#sec-59_1">59.1 Validation </a>
<ul>
<li><a href="#sec-59_1_1">59.1.1 Overview of Nitrogen Validation </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-60">60 Overview of Nitrogen Validation </a>
<ul>
<li><a href="#sec-60_1">60.1 Validation </a>
<ul>
<li><a href="#sec-60_1_1">60.1.1 Overview of Nitrogen Validation </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-61">61 Overview of Nitrogen Validation </a>
<ul>
<li><a href="#sec-61_1">61.1 Validation </a>
<ul>
<li><a href="#sec-61_1_1">61.1.1 Overview of Nitrogen Validation </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-62">62 Overview of Nitrogen Validation </a>
<ul>
<li><a href="#sec-62_1">62.1 Validation </a>
<ul>
<li><a href="#sec-62_1_1">62.1.1 Overview of Nitrogen Validation </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-63">63 PART 9 AGENDA </a>
<ul>
<li><a href="#sec-63_1">63.1 Comet </a></li>
</ul>
</li>
<li><a href="#sec-64">64 What is Comet? </a>
<ul>
<li><a href="#sec-64_1">64.1 Comet </a>
<ul>
<li><a href="#sec-64_1_1">64.1.1 What is Comet? </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-65">65 Comet the Nitrogen/Erlang Way </a>
<ul>
<li><a href="#sec-65_1">65.1 Comet </a>
<ul>
<li><a href="#sec-65_1_1">65.1.1 Comet the Nitrogen/Erlang Way </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-66">66 A Comet Counter </a>
<ul>
<li><a href="#sec-66_1">66.1 Comet </a>
<ul>
<li><a href="#sec-66_1_1">66.1.1 A Comet Counter </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-67">67 Comet Pools </a>
<ul>
<li><a href="#sec-67_1">67.1 Comet </a>
<ul>
<li><a href="#sec-67_1_1">67.1.1 Comet Pools </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-68">68 Comet Pool Scope </a>
<ul>
<li><a href="#sec-68_1">68.1 Comet </a>
<ul>
<li><a href="#sec-68_1_1">68.1.1 Comet Pool Scope </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-69">69 The Simplest Chatroom Ever Constructed </a>
<ul>
<li><a href="#sec-69_1">69.1 Comet </a>
<ul>
<li><a href="#sec-69_1_1">69.1.1 The Simplest Chatroom Ever Constructed </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-70">70 PART 10 AGENDA </a>
<ul>
<li><a href="#sec-70_1">70.1 Extending Nitrogen </a></li>
</ul>
</li>
<li><a href="#sec-71">71 Custom Elements - Part 1 </a>
<ul>
<li><a href="#sec-71_1">71.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-71_1_1">71.1.1 Custom Elements - Part 1 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-72">72 Custom Elements - Part 2 </a>
<ul>
<li><a href="#sec-72_1">72.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-72_1_1">72.1.1 Custom Elements - Part 2 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-73">73 Custom Elements - Part 3 </a>
<ul>
<li><a href="#sec-73_1">73.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-73_1_1">73.1.1 Custom Elements - Part 3 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-74">74 Custom Elements - Part 4 </a>
<ul>
<li><a href="#sec-74_1">74.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-74_1_1">74.1.1 Custom Elements - Part 4 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-75">75 Custom Actions - Part 1 </a>
<ul>
<li><a href="#sec-75_1">75.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-75_1_1">75.1.1 Custom Actions - Part 1 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-76">76 Custom Actions - Part 2 </a>
<ul>
<li><a href="#sec-76_1">76.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-76_1_1">76.1.1 Custom Actions - Part 2 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-77">77 Custom Actions - Part 3 </a>
<ul>
<li><a href="#sec-77_1">77.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-77_1_1">77.1.1 Custom Actions - Part 3 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-78">78 Handlers - Part 1 </a>
<ul>
<li><a href="#sec-78_1">78.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-78_1_1">78.1.1 Handlers - Part 1 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-79">79 Handlers - Part 2 </a>
<ul>
<li><a href="#sec-79_1">79.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-79_1_1">79.1.1 Handlers - Part 2 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-80">80 Handlers - Part 3 </a>
<ul>
<li><a href="#sec-80_1">80.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-80_1_1">80.1.1 Handlers - Part 3 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-81">81 Handlers - Part 3 </a>
<ul>
<li><a href="#sec-81_1">81.1 Extending Nitrogen </a>
<ul>
<li><a href="#sec-81_1_1">81.1.1 Handlers - Part 3 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-82">82 Conclusion </a>
<ul>
<li><a href="#sec-82_1">82.1 Conclusion </a></li>
</ul>
</li>
<li><a href="#sec-83">83 Conclusion </a>
<ul>
<li><a href="#sec-83_1">83.1 Thanks </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Welcome </h2>
<div class="outline-text-2" id="text-1">


<div style="text-align:center; font-size: 400%; line-height: 1em;">
<br>
Introduction to Nitrogen
<hr>
</div>
<div style="text-align:center; font-size: 100%; line-height: 1.5em;">
A step-by-step introduction to the<br>
major features and concepts behind<br>
the Nitrogen Web Framework.
</div>

</div>

</div>
