doc/org-mode/tutorial.org
* Main Agenda Slide
** Agenda
  + Part 1: Install & Run Nitrogen
  + Part 2: Nitrogen Pages
  + Part 3: Nitrogen Elements
  + Part 4: Nitrogen Actions
  + Part 5: Nitrogen Postback Events
  + Part 6: Session and Page State
  + Part 7: Security
  + Part 8: Validation
  + Part 9: Comet
  + Part 10: Extending Nitrogen
  + Conclusion

* PART 1 AGENDA
** Install & Run Nitrogen
  
  + Install Nitrogen
  + Run the Website
  + A Tour Through the Files

* Install Nitrogen
** Install Nitrogen

*** If you *don't* have Erlang Installed:

[[http://nitrogenproject.com/downloads][Download Nitrogen]], unzip and =cd nitrogen=.

*** If you *do* have Erlang installed:

Pull the [[http://github.com/rklophaus/nitrogen][Nitrogen Source Code]], then =make rel_inets; cd rel/nitrogen=.

* Start the Website in Console Mode
** Install & Run Nitrogen
*** Start Up
    : bin/nitrogen console
    : open http://localhost:8000

* Stop the Website
** Install & Run Nitrogen
*** Shut Down
    /Press Control-C twice./

*** View the Directory
    : ls -l

* Anatomy of a Nitrogen Project
** Install & Run Nitrogen
*** Anatomy of a Nitrogen Project
    + BuildInfo.txt :: From =uname=.
    + Makefile :: Used by =make=.
    + bin/ :: Commands to start and stop system, plus developer tools.
    + etc/ :: Configuration settings.
    + site/ :: Contains the website files, templates, and Erlang modules.
    + log/ :: The logs.
    + doc/ :: Contains Nitrogen documentation.
    + erts-5.7.5/ :: Embedded Erlang.
    + releases/ :: Tells Erlang how to start the system.
    + lib/ :: Dependent libraries.

* Anatomy of the site/ Directory
** Install & Run Nitrogen
*** The =site/= Directory
    The site directory should go under source control, it contains all
    of the information necessary to run the website.

    + Emakefile :: Used by make.erl to compile the system.
    + ebin/ :: Compiled Erlang modules.
    + include/ :: Include files for your website.
    + src/ :: Erlang source files for your website.
    + static/ :: Static files for your website.
    + templates/ :: Template files for your website.
             
* Anatomy of the site/src Directory
** Install & Run Nitrogen
*** The =site/src/= Directory
    Stores the Erlang source files for your application. By default it
    contains:

    + nitrogen\_init.erl :: Runs once on Nitrogen startup.
    + nitrogen\_PLATFORM.erl :: Holds the request loop depending on
         platform.
    + index.erl :: The default web page.
    + elements/ :: By convention, custom alements are placed here.
    + actions/ :: By convention, custom actions are placed here.

* Exercise: Modify a Nitrogen Page
** Install & Run Nitrogen
*** Exercise: Modify Your First Page
    + Open =site/src/index.erl=
    + Change "Welcome to Nitrogen" to "Welcome to My Website"
    + From the Erlang Shell, run:
      : sync:go()
    + Reload the page

* Exercise: Compile in Different Ways
** Install & Run Nitrogen
*** Exercise: Compile in a Different Way
    + Change to "Welcome to my ERL-TASTIC WEBSITE!" (or, you know, whatever)
    + From a different terminal, run:
      : bin/dev compile
    + Reload the page

* Exercise: Debugging
** Install & Run Nitrogen
*** Debug Statements
    + Add =?DEBUG= to =index.erl=. Then compile and
      reload. What happens?
    + Add =?PRINT(node())= to =index.erl=. Then compile and reload. What
      happens?

* Emacs Mode
** Install & Run Nitrogen
*** Emacs =nitrogen-mode=
    #+BEGIN_SRC lisp
    (add-to-list 'load-path "PATH/TO/NITROGEN/support/nitrogen-mode")
    (require 'nitrogen-mode)
    #+END_SRC

    Without =nitrogen-mode=:
    #+BEGIN_SRC erlang
    #panel { id=my_panel, body=[
                                #panel { id=my_panel2, body=[
                                                             #label { text="Name" },
                                                             #textbox { id=my_textbox }
                                                            ]}
                               ]}
    #+END_SRC

    With =nitrogen-mode=:
    #+BEGIN_SRC erlang
    M-x nitrogen-mode
    #panel { id=my_panel, body=[
        #panel { id=my_panel2, body=[
            #label { text="Name" },
            #textbox { id=my_textbox }
        ]}
    ]}
    #+END_SRC

* PART 2 AGENDA
