doc/org-mode/tutorial.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Main Agenda Slide </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Agenda </h3>
<div class="outline-text-3" id="text-2_1">

<ul>
<li>
Part 1: Install &amp; Run Nitrogen
</li>
<li>
Part 2: Nitrogen Pages
</li>
<li>
Part 3: Nitrogen Elements
</li>
<li>
Part 4: Nitrogen Actions
</li>
<li>
Part 5: Nitrogen Postback Events
</li>
<li>
Part 6: Session and Page State
</li>
<li>
Part 7: Security
</li>
<li>
Part 8: Validation
</li>
<li>
Part 9: Comet
</li>
<li>
Part 10: Extending Nitrogen
</li>
<li>
Conclusion

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> PART 1 AGENDA </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-3_1">


<ul>
<li>
Install Nitrogen
</li>
<li>
Run the Website
</li>
<li>
A Tour Through the Files

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Install Nitrogen </h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Install Nitrogen </h3>
<div class="outline-text-3" id="text-4_1">



</div>

<div id="outline-container-4_1_1" class="outline-4">
<h4 id="sec-4_1_1"><span class="section-number-4">4.1.1</span> If you <b>don't</b> have Erlang Installed: </h4>
<div class="outline-text-4" id="text-4_1_1">


<p>
<a href="http://nitrogenproject.com/downloads">Download Nitrogen</a>, unzip and <code>cd nitrogen</code>.
</p>
</div>

</div>

<div id="outline-container-4_1_2" class="outline-4">
<h4 id="sec-4_1_2"><span class="section-number-4">4.1.2</span> If you <b>do</b> have Erlang installed: </h4>
<div class="outline-text-4" id="text-4_1_2">


<p>
Pull the <a href="http://github.com/rklophaus/nitrogen">Nitrogen Source Code</a>, then <code>make rel_inets; cd rel/nitrogen</code>.
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Start the Website in Console Mode </h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3">5.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-5_1">


</div>

<div id="outline-container-5_1_1" class="outline-4">
<h4 id="sec-5_1_1"><span class="section-number-4">5.1.1</span> Start Up </h4>
<div class="outline-text-4" id="text-5_1_1">

<pre class="example">
bin/nitrogen console
open http://localhost:8000
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Stop the Website </h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3">6.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-6_1">


</div>

<div id="outline-container-6_1_1" class="outline-4">
<h4 id="sec-6_1_1"><span class="section-number-4">6.1.1</span> Shut Down </h4>
<div class="outline-text-4" id="text-6_1_1">

<p><i>Press Control-C twice.</i>
</p>
</div>

</div>

<div id="outline-container-6_1_2" class="outline-4">
<h4 id="sec-6_1_2"><span class="section-number-4">6.1.2</span> View the Directory </h4>
<div class="outline-text-4" id="text-6_1_2">

<pre class="example">
ls -l
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Anatomy of a Nitrogen Project </h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-7_1">


</div>

<div id="outline-container-7_1_1" class="outline-4">
<h4 id="sec-7_1_1"><span class="section-number-4">7.1.1</span> Anatomy of a Nitrogen Project </h4>
<div class="outline-text-4" id="text-7_1_1">

<dl>
<dt>BuildInfo.txt</dt><dd>
From <code>uname</code>.
</dd>
<dt>Makefile</dt><dd>
Used by <code>make</code>.
</dd>
<dt>bin/</dt><dd>
Commands to start and stop system, plus developer tools.
</dd>
<dt>etc/</dt><dd>
Configuration settings.
</dd>
<dt>site/</dt><dd>
Contains the website files, templates, and Erlang modules.
</dd>
<dt>log/</dt><dd>
The logs.
</dd>
<dt>doc/</dt><dd>
Contains Nitrogen documentation.
</dd>
<dt>erts-5.7.5/</dt><dd>
Embedded Erlang.
</dd>
<dt>releases/</dt><dd>
Tells Erlang how to start the system.
</dd>
<dt>lib/</dt><dd>
Dependent libraries.

</dd>
</dl>
</div>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Anatomy of the site/ Directory </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8_1" class="outline-3">
<h3 id="sec-8_1"><span class="section-number-3">8.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-8_1">


</div>

<div id="outline-container-8_1_1" class="outline-4">
<h4 id="sec-8_1_1"><span class="section-number-4">8.1.1</span> The <code>site/</code> Directory </h4>
<div class="outline-text-4" id="text-8_1_1">

<p>The site directory should go under source control, it contains all
of the information necessary to run the website.
</p>
<dl>
<dt>Emakefile</dt><dd>
Used by make.erl to compile the system.
</dd>
<dt>ebin/</dt><dd>
Compiled Erlang modules.
</dd>
<dt>include/</dt><dd>
Include files for your website.
</dd>
<dt>src/</dt><dd>
Erlang source files for your website.
</dd>
<dt>static/</dt><dd>
Static files for your website.
</dd>
<dt>templates/</dt><dd>
Template files for your website.

</dd>
</dl>
</div>
</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Anatomy of the site/src Directory </h2>
<div class="outline-text-2" id="text-9">


</div>

<div id="outline-container-9_1" class="outline-3">
<h3 id="sec-9_1"><span class="section-number-3">9.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-9_1">


</div>

<div id="outline-container-9_1_1" class="outline-4">
<h4 id="sec-9_1_1"><span class="section-number-4">9.1.1</span> The <code>site/src/</code> Directory </h4>
<div class="outline-text-4" id="text-9_1_1">

<p>Stores the Erlang source files for your application. By default it
contains:
</p>
<dl>
<dt>nitrogen_init.erl</dt><dd>
Runs once on Nitrogen startup.
</dd>
<dt>nitrogen_PLATFORM.erl</dt><dd>
Holds the request loop depending on
platform.
</dd>
<dt>index.erl</dt><dd>
The default web page.
</dd>
<dt>elements/</dt><dd>
By convention, custom alements are placed here.
</dd>
<dt>actions/</dt><dd>
By convention, custom actions are placed here.

</dd>
</dl>
</div>
</div>
</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Exercise: Modify a Nitrogen Page </h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10_1" class="outline-3">
<h3 id="sec-10_1"><span class="section-number-3">10.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-10_1">


</div>

<div id="outline-container-10_1_1" class="outline-4">
<h4 id="sec-10_1_1"><span class="section-number-4">10.1.1</span> Exercise: Modify Your First Page </h4>
<div class="outline-text-4" id="text-10_1_1">

<ul>
<li>
Open <code>site/src/index.erl</code>
</li>
<li>
Change "Welcome to Nitrogen" to "Welcome to My Website"
</li>
<li>
From the Erlang Shell, run:
<pre class="example">
sync:go()
</pre>

</li>
<li>
Reload the page

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Exercise: Compile in Different Ways </h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11_1" class="outline-3">
<h3 id="sec-11_1"><span class="section-number-3">11.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-11_1">


</div>

<div id="outline-container-11_1_1" class="outline-4">
<h4 id="sec-11_1_1"><span class="section-number-4">11.1.1</span> Exercise: Compile in a Different Way </h4>
<div class="outline-text-4" id="text-11_1_1">

<ul>
<li>
Change to "Welcome to my ERL-TASTIC WEBSITE!" (or, you know, whatever)
</li>
<li>
From a different terminal, run:
<pre class="example">
bin/dev compile
</pre>

</li>
<li>
Reload the page

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Exercise: Debugging </h2>
<div class="outline-text-2" id="text-12">


</div>

<div id="outline-container-12_1" class="outline-3">
<h3 id="sec-12_1"><span class="section-number-3">12.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-12_1">


</div>

<div id="outline-container-12_1_1" class="outline-4">
<h4 id="sec-12_1_1"><span class="section-number-4">12.1.1</span> Debug Statements </h4>
<div class="outline-text-4" id="text-12_1_1">

<ul>
<li>
Add <code>?DEBUG</code> to <code>index.erl</code>. Then compile and
reload. What happens?
</li>
<li>
Add <code>?PRINT(node())</code> to <code>index.erl</code>. Then compile and reload. What
happens?

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Emacs Mode </h2>
<div class="outline-text-2" id="text-13">


</div>

<div id="outline-container-13_1" class="outline-3">
<h3 id="sec-13_1"><span class="section-number-3">13.1</span> Install &amp; Run Nitrogen </h3>
<div class="outline-text-3" id="text-13_1">


</div>

<div id="outline-container-13_1_1" class="outline-4">
<h4 id="sec-13_1_1"><span class="section-number-4">13.1.1</span> Emacs <code>nitrogen-mode</code> </h4>
<div class="outline-text-4" id="text-13_1_1">




<pre class="src src-lisp">(add-to-list 'load-path <span style="color: #09A240;">"PATH/TO/NITROGEN/support/nitrogen-mode"</span>)
(<span style="color: #FB5D17;">require</span> '<span style="color: #A639AE;">nitrogen-mode</span>)
</pre>



<p>
Without <code>nitrogen-mode</code>:
</p>


<pre class="src src-erlang">#<span style="color: #28439B;">panel</span> { id=my_panel, body=[
                            #<span style="color: #28439B;">panel</span> { id=my_panel2, body=[
                                                         #<span style="color: #28439B;">label</span> { text=<span style="color: #09A240;">"Name"</span> },
                                                         #<span style="color: #28439B;">textbox</span> { id=my_textbox }
                                                        ]}
                           ]}
</pre>



<p>
With <code>nitrogen-mode</code>:
</p>


<pre class="src src-erlang">M-x nitrogen-mode
#<span style="color: #28439B;">panel</span> { id=my_panel, body=[
    #<span style="color: #28439B;">panel</span> { id=my_panel2, body=[
        #<span style="color: #28439B;">label</span> { text=<span style="color: #09A240;">"Name"</span> },
        #<span style="color: #28439B;">textbox</span> { id=my_textbox }
    ]}
]}
</pre>



</div>
</div>
</div>

</div>
