doc/org-mode/tutorial.org
** Nitrogen Pages
   + What is a Nitrogen Page?
   + Dynamic Routing Explained
   + Creating Your First Page
   + How is a Page Rendered?
   + Anatomy of a Template
   + Experimenting With Templates

* What is a Nitrogen Page?
** Nitrogen Pages
*** What is a Nitrogen Page
    + A Page is an Erlang Module
    + Each page should accomplish one store or piece of
      functionality. 
      
      Some examples:
      + Allow the user to log in (=user_login.erl=).
      + Change the user's preferences. (=user_preferences.erl=)
      + Display a list of items. (=items_view.erl=)
      + Allow the user to edit an item. (=items_edit.erl=)

* Dynamic Routes Explained
** Nitrogen Pages
*** Dynamic Routing Explained
    Dynamic routing rules:
    1. If there is an extension, assume a static file.
       : http://localhost:8000/routes/to/a/module
       : http://localhost:8000/routes/to/a/static/file.html
    2. Root page maps to =index.erl=
    3. Replaces slashes with underscores.
       : http://localhost:8000/routes/to/a/module ->
       : routes_to_a_module.erl
    4. Try the longest matching module.
       : http://localhost:8000/routes/to/a/module/foo/bar ->
       : routes_to_a_module.erl
    5. Modules that aren't found go to =web\_404.erl= if it exists.
    6. Static files that aren't found are handled by the underlying
       platform (not yet generalized.)

* Creating a New Page
** Nitrogen Pages
*** Exercise: Create a New Page
    + Generate the Page
      : bin/dev page my\_page
      : $EDIT site/src/my\_page.erl

    + Replace the default body with:
      #+BEGIN_SRC erlang
      body() -> "Hello World!".
      #+END_SRC

    + Remove the =event/1= function.
    
    + Compile the page and load =http://localhost:8080/my/page=

* How is a Page Rendered (Simple Version)
** Nitrogen Pages
*** How is a Page Rendered?
    1. User hits a URL.
    2. URL is mapped to a module.
    3. Nitrogen framework calls =module:main()=
    4. =module:main()= calls a =#template= 
    5. =#template= calls back into the page (or other modules)
    6. Nitrogen framework renders the output into HTML/Javascript.
    (This is the simple version. Complex version will come later.)

* Anatomy of a Template
** Nitrogen Pages
*** Anatomy of a Template
    + HTML. The Page is slurped into the Template.
    + Contains one or more callouts, ie:
      : [[[module:body()]]]
    + Contains a script callout for Javascript:
      : [[[script]]]
    + The callouts look like Erlang, but they are not. They can only be
      of the form =module:function(Args)=. The 'page' module refers to
      the current page.

* Experimenting With Templates
** Nitrogen Pages
*** Experimenting With Templates
    + Change the callout from =page:body()= to =page:body1()= in the
      default template and reload the page. What happens?

    + Create another callout. What happens?

    + What happens when you change =page= to be a specific module?

    + Replace the module call with some arbitrary Erlang code. What happens?

* PART 3 AGENDA
** Nitrogen Elements
   + What is a Nitrogen Element?
   + Add Elements to Your Page
   + Nested Elements
   + Documentation
   + Anatomy of a Nitrogen Element

* What is a Nitrogen Element?
** Nitrogen Elements
*** What is a Nitrogen Element?
    An element can be either HTML, or some record that renders into
    HTML.

    Change this:
    #+BEGIN_SRC erlang
    body() -> "Hello World!".
    #+END_SRC

    To this:
    #+BEGIN_SRC erlang
    body() -> #label { text="Hello World!" }.
    #+END_SRC

* What is a Nitrogen Element?
** Nitrogen Elements
*** What is a Nitrogen Element?
    The =#label{}= element is rendered into:

    #+BEGIN_SRC html
    <label class="wfid_tempNNNNN label">Hello World!</label>
    #+END_SRC

    View the rendered page source in your browser and search for "Hello World".

* Nitrogen Element Properties
** Nitrogen Elements
*** Why Nitrogen Elements?

    Nitrogen elements serve two purposes:
    
    1. Allow you to generate HTML within Erlang:
       + Avoid mixing languages == clearer code.
       + Fewer characters to type.
       + Checked at compile time.

    2. Abstraction layer:
       + Avoid repeating common functionality.
       + Hide complexity in a module.
    
* Nitrogen Element Examples
** Nitrogen Elements
