doc/org-mode/tutorial.html

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> PART 2 AGENDA </h2>
<div class="outline-text-2" id="text-14">


</div>

<div id="outline-container-14_1" class="outline-3">
<h3 id="sec-14_1"><span class="section-number-3">14.1</span> Nitrogen Pages </h3>
<div class="outline-text-3" id="text-14_1">

<ul>
<li>
What is a Nitrogen Page?
</li>
<li>
Dynamic Routing Explained
</li>
<li>
Creating Your First Page
</li>
<li>
How is a Page Rendered?
</li>
<li>
Anatomy of a Template
</li>
<li>
Experimenting With Templates

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> What is a Nitrogen Page? </h2>
<div class="outline-text-2" id="text-15">


</div>

<div id="outline-container-15_1" class="outline-3">
<h3 id="sec-15_1"><span class="section-number-3">15.1</span> Nitrogen Pages </h3>
<div class="outline-text-3" id="text-15_1">


</div>

<div id="outline-container-15_1_1" class="outline-4">
<h4 id="sec-15_1_1"><span class="section-number-4">15.1.1</span> What is a Nitrogen Page </h4>
<div class="outline-text-4" id="text-15_1_1">

<ul>
<li>
A Page is an Erlang Module
</li>
<li>
Each page should accomplish one store or piece of
functionality. 

<p>
Some examples:
</p><ul>
<li>
Allow the user to log in (<code>user_login.erl</code>).
</li>
<li>
Change the user's preferences. (<code>user_preferences.erl</code>)
</li>
<li>
Display a list of items. (<code>items_view.erl</code>)
</li>
<li>
Allow the user to edit an item. (<code>items_edit.erl</code>)

</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Dynamic Routes Explained </h2>
<div class="outline-text-2" id="text-16">


</div>

<div id="outline-container-16_1" class="outline-3">
<h3 id="sec-16_1"><span class="section-number-3">16.1</span> Nitrogen Pages </h3>
<div class="outline-text-3" id="text-16_1">


</div>

<div id="outline-container-16_1_1" class="outline-4">
<h4 id="sec-16_1_1"><span class="section-number-4">16.1.1</span> Dynamic Routing Explained </h4>
<div class="outline-text-4" id="text-16_1_1">

<p>Dynamic routing rules:
</p><ol>
<li>
If there is an extension, assume a static file.
<pre class="example">
http://localhost:8000/routes/to/a/module
http://localhost:8000/routes/to/a/static/file.html
</pre>

</li>
<li>
Root page maps to <code>index.erl</code>
</li>
<li>
Replaces slashes with underscores.
<pre class="example">
http://localhost:8000/routes/to/a/module -&gt;
routes_to_a_module.erl
</pre>

</li>
<li>
Try the longest matching module.
<pre class="example">
http://localhost:8000/routes/to/a/module/foo/bar -&gt;
routes_to_a_module.erl
</pre>

</li>
<li>
Modules that aren't found go to <code>web_404.erl</code> if it exists.
</li>
<li>
Static files that aren't found are handled by the underlying
platform (not yet generalized.)

</li>
</ol>
</div>
</div>
</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Creating a New Page </h2>
<div class="outline-text-2" id="text-17">


</div>

<div id="outline-container-17_1" class="outline-3">
<h3 id="sec-17_1"><span class="section-number-3">17.1</span> Nitrogen Pages </h3>
<div class="outline-text-3" id="text-17_1">


</div>

<div id="outline-container-17_1_1" class="outline-4">
<h4 id="sec-17_1_1"><span class="section-number-4">17.1.1</span> Exercise: Create a New Page </h4>
<div class="outline-text-4" id="text-17_1_1">

<ul>
<li>
Generate the Page
<pre class="example">
bin/dev page my\_page
$EDIT site/src/my\_page.erl
</pre>


</li>
<li>
Replace the default body with:



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span><span style="color: #09A240;">"Hello World!"</span>.
</pre>



</li>
<li>
Remove the <code>event/1</code> function.

</li>
<li>
Compile the page and load <code>http://localhost:8080/my/page</code>

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> How is a Page Rendered (Simple Version) </h2>
<div class="outline-text-2" id="text-18">


</div>

<div id="outline-container-18_1" class="outline-3">
<h3 id="sec-18_1"><span class="section-number-3">18.1</span> Nitrogen Pages </h3>
<div class="outline-text-3" id="text-18_1">


</div>

<div id="outline-container-18_1_1" class="outline-4">
<h4 id="sec-18_1_1"><span class="section-number-4">18.1.1</span> How is a Page Rendered? </h4>
<div class="outline-text-4" id="text-18_1_1">

<ol>
<li>
User hits a URL.
</li>
<li>
URL is mapped to a module.
</li>
<li>
Nitrogen framework calls <code>module:main()</code>
</li>
<li>
<code>module:main()</code> calls a <code>#template</code> 
</li>
<li>
<code>#template</code> calls back into the page (or other modules)
</li>
<li>
Nitrogen framework renders the output into HTML/Javascript.
</li>
</ol>

<p>(This is the simple version. Complex version will come later.)
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> Anatomy of a Template </h2>
<div class="outline-text-2" id="text-19">


</div>

<div id="outline-container-19_1" class="outline-3">
<h3 id="sec-19_1"><span class="section-number-3">19.1</span> Nitrogen Pages </h3>
<div class="outline-text-3" id="text-19_1">


</div>

<div id="outline-container-19_1_1" class="outline-4">
<h4 id="sec-19_1_1"><span class="section-number-4">19.1.1</span> Anatomy of a Template </h4>
<div class="outline-text-4" id="text-19_1_1">

<ul>
<li>
HTML. The Page is slurped into the Template.
</li>
<li>
Contains one or more callouts, ie:
<pre class="example">
[[[module:body()]]]
</pre>

</li>
<li>
Contains a script callout for Javascript:
<pre class="example">
[[[script]]]
</pre>

</li>
<li>
The callouts look like Erlang, but they are not. They can only be
of the form <code>module:function(Args)</code>. The 'page' module refers to
the current page.

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Experimenting With Templates </h2>
<div class="outline-text-2" id="text-20">


</div>

<div id="outline-container-20_1" class="outline-3">
<h3 id="sec-20_1"><span class="section-number-3">20.1</span> Nitrogen Pages </h3>
<div class="outline-text-3" id="text-20_1">


</div>

<div id="outline-container-20_1_1" class="outline-4">
<h4 id="sec-20_1_1"><span class="section-number-4">20.1.1</span> Experimenting With Templates </h4>
<div class="outline-text-4" id="text-20_1_1">

<ul>
<li>
Change the callout from <code>page:body()</code> to <code>page:body1()</code> in the
default template and reload the page. What happens?

</li>
<li>
Create another callout. What happens?

</li>
<li>
What happens when you change <code>page</code> to be a specific module?

</li>
<li>
Replace the module call with some arbitrary Erlang code. What happens?

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> PART 3 AGENDA </h2>
<div class="outline-text-2" id="text-21">


</div>

<div id="outline-container-21_1" class="outline-3">
<h3 id="sec-21_1"><span class="section-number-3">21.1</span> Nitrogen Elements </h3>
<div class="outline-text-3" id="text-21_1">

<ul>
<li>
What is a Nitrogen Element?
</li>
<li>
Add Elements to Your Page
</li>
<li>
Nested Elements
</li>
<li>
Documentation
</li>
<li>
Anatomy of a Nitrogen Element

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> What is a Nitrogen Element? </h2>
<div class="outline-text-2" id="text-22">


</div>

<div id="outline-container-22_1" class="outline-3">
<h3 id="sec-22_1"><span class="section-number-3">22.1</span> Nitrogen Elements </h3>
<div class="outline-text-3" id="text-22_1">


</div>

<div id="outline-container-22_1_1" class="outline-4">
<h4 id="sec-22_1_1"><span class="section-number-4">22.1.1</span> What is a Nitrogen Element? </h4>
<div class="outline-text-4" id="text-22_1_1">

<p>An element can be either HTML, or some record that renders into
HTML.
</p>
<p>
Change this:
</p>


<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span><span style="color: #09A240;">"Hello World!"</span>.
</pre>



<p>
To this:
</p>


<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>#<span style="color: #28439B;">label</span> { text=<span style="color: #09A240;">"Hello World!"</span> }.
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> What is a Nitrogen Element? </h2>
<div class="outline-text-2" id="text-23">


</div>

<div id="outline-container-23_1" class="outline-3">
<h3 id="sec-23_1"><span class="section-number-3">23.1</span> Nitrogen Elements </h3>
<div class="outline-text-3" id="text-23_1">


</div>

<div id="outline-container-23_1_1" class="outline-4">
<h4 id="sec-23_1_1"><span class="section-number-4">23.1.1</span> What is a Nitrogen Element? </h4>
<div class="outline-text-4" id="text-23_1_1">

<p>The <code>#label{}</code> element is rendered into:
</p>



<pre class="src src-html">&lt;<span style="color: #28439B;">label</span> <span style="color: #000000;">class</span>=<span style="color: #09A240;">"wfid_tempNNNNN label"</span>&gt;Hello World!&lt;/<span style="color: #28439B;">label</span>&gt;
</pre>



<p>
View the rendered page source in your browser and search for "Hello World".
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> Nitrogen Element Properties </h2>
<div class="outline-text-2" id="text-24">


</div>

<div id="outline-container-24_1" class="outline-3">
<h3 id="sec-24_1"><span class="section-number-3">24.1</span> Nitrogen Elements </h3>
<div class="outline-text-3" id="text-24_1">


</div>

<div id="outline-container-24_1_1" class="outline-4">
<h4 id="sec-24_1_1"><span class="section-number-4">24.1.1</span> Why Nitrogen Elements? </h4>
<div class="outline-text-4" id="text-24_1_1">


<p>
Nitrogen elements serve two purposes:
</p>
<ol>
<li>
Allow you to generate HTML within Erlang:
<ul>
<li>
Avoid mixing languages == clearer code.
</li>
<li>
Fewer characters to type.
</li>
<li>
Checked at compile time.

</li>
</ul>
</li>
<li>
Abstraction layer:
<ul>
<li>
Avoid repeating common functionality.
</li>
<li>
Hide complexity in a module.

</li>
</ul>
</li>
</ol>
</div>
</div>
</div>

</div>
