doc/org-mode/tutorial.org
*** Nitrogen Element Examples
    
    Try this on my\_page.erl:
    #+BEGIN_SRC erlang
    body() -> [
        #h1 { text="My Simple Application" },
        #label { text="What is your name?" },
        #textbox { },
        #button { text="Submit" }
    ].
    #+END_SRC

    Then compile, reload, and view source.

* Nested Elements
** Nitrogen Elements
*** Nested Elements
    
    Try a nested element:

    #+BEGIN_SRC erlang
    body() -> 
        #panel { style="margin: 50px;", body=[
            #h1 { text="My Page" },
            #label { text="Enter Your Name:" },
            #textbox { },
            #button { text="Submit" }
        ]}.
    #+END_SRC

* PART 4 AGENDA
** Nitrogen Actions
   + What is a Nitrogen Action?
   + Wiring an Action
   + Conditional Actions with =#event{}=
   + Postbacks

* What is a Nitrogen Action?
** Nitrogen Actions
*** What is a Nitrogen Action?
    An action can either be Javascript, or some record that renders
    into Javascript.

    Add a Javascript alert to the =#button{}= element. Then recompile
    and run. What do you expect will happen?

    #+BEGIN_SRC erlang
    body() ->
        [
            #button { text="Submit", actions="alert('hello');" }
        ].
    #+END_SRC
        
* What is a Nitrogen Action?
** Nitrogen Actions
*** What is a Nitrogen Action?
    Do the same thing a different way.

    #+BEGIN_SRC erlang
    body() ->
        [
            #button { 
                text="Submit", 
                actions=#alert { text="Hello" } 
            }
        ].
    #+END_SRC

* Wiring an Action
** Nitrogen Actions
*** Wiring an Action

    Setting the =actions= property of an element can lead to messy
    code. Another, cleaner way to wire an action is the =wf:wire/N=
    function.

    #+BEGIN_SRC erlang
    body() -> 
        wf:wire(mybutton, #effect { effect=pulsate }),
        [
            #button { id=mybutton, text="Submit" }
        ].
    #+END_SRC

* Conditional Actions with =#event{}=
** Nitrogen Actions
*** Conditional Actions with =#event{}=

    Put the =#effect{}= action inside of an =#event{}= action. This
    causes the effect to *only* get fired if the user clicks on
    =mybutton=.

    #+BEGIN_SRC erlang
    body() -> 
        wf:wire(mybutton, #event { 
            type=click, 
            actions=#effect { effect=pulsate }
        }),
        [
            #button { id=mybutton, text="Submit" }
        ].
    #+END_SRC

* Triggers and Targets
** Nitrogen Actions
*** Triggers and Targets

    All actions have a =target= property. The =target= specifies what
    element(s) the action effects.

    The event action also has a =trigger= property. The =trigger=
    specifies what element(s) trigger the action.

    Try this:

    #+BEGIN_SRC erlang
    body() -> 
        wf:wire(#event { 
            type=click, trigger=mybutton, target=mylabel,
            actions=#effect { effect=pulsate }
        }),
        [
            #label { id=mylabel, text="Make Me Blink!" },
            #button { id=mybutton, text="Submit" }
        ].
    #+END_SRC

* Triggers and Targets
** Nitrogen Actions
*** Triggers and Targets

    You can also specify the *Trigger* and *Target* directly in =wf:wire/N=. It takes three forms:

    #+BEGIN_SRC erlang
    % Specify a trigger and target.
    wf:wire(Trigger, Target, Actions)

    % Use the same element for both trigger and target.
    wf:wire(TriggerAndTarget, Actions)

    % Assume the trigger and/or target is provided in the actions. 
    % If not, then wire the action directly to the page. 
    % (Useful for catching keystrokes.)
    wf:wire(Actions)
    #+END_SRC

* Quick Review
** Nitrogen Actions
