doc/org-mode/tutorial.html

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> Nitrogen Element Examples </h2>
<div class="outline-text-2" id="text-25">


</div>

<div id="outline-container-25_1" class="outline-3">
<h3 id="sec-25_1"><span class="section-number-3">25.1</span> Nitrogen Elements </h3>
<div class="outline-text-3" id="text-25_1">


</div>

<div id="outline-container-25_1_1" class="outline-4">
<h4 id="sec-25_1_1"><span class="section-number-4">25.1.1</span> Nitrogen Element Examples </h4>
<div class="outline-text-4" id="text-25_1_1">


<p>
Try this on my_page.erl:
</p>


<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>[
    #<span style="color: #28439B;">h1</span> { text=<span style="color: #09A240;">"My Simple Application"</span> },
    #<span style="color: #28439B;">label</span> { text=<span style="color: #09A240;">"What is your name?"</span> },
    #<span style="color: #28439B;">textbox</span> { },
    #<span style="color: #28439B;">button</span> { text=<span style="color: #09A240;">"Submit"</span> }
].
</pre>



<p>
Then compile, reload, and view source.
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> Nested Elements </h2>
<div class="outline-text-2" id="text-26">


</div>

<div id="outline-container-26_1" class="outline-3">
<h3 id="sec-26_1"><span class="section-number-3">26.1</span> Nitrogen Elements </h3>
<div class="outline-text-3" id="text-26_1">


</div>

<div id="outline-container-26_1_1" class="outline-4">
<h4 id="sec-26_1_1"><span class="section-number-4">26.1.1</span> Nested Elements </h4>
<div class="outline-text-4" id="text-26_1_1">


<p>
Try a nested element:
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    #<span style="color: #28439B;">panel</span> { style=<span style="color: #09A240;">"margin: 50px;"</span>, body=[
        #<span style="color: #28439B;">h1</span> { text=<span style="color: #09A240;">"My Page"</span> },
        #<span style="color: #28439B;">label</span> { text=<span style="color: #09A240;">"Enter Your Name:"</span> },
        #<span style="color: #28439B;">textbox</span> { },
        #<span style="color: #28439B;">button</span> { text=<span style="color: #09A240;">"Submit"</span> }
    ]}.
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> PART 4 AGENDA </h2>
<div class="outline-text-2" id="text-27">


</div>

<div id="outline-container-27_1" class="outline-3">
<h3 id="sec-27_1"><span class="section-number-3">27.1</span> Nitrogen Actions </h3>
<div class="outline-text-3" id="text-27_1">

<ul>
<li>
What is a Nitrogen Action?
</li>
<li>
Wiring an Action
</li>
<li>
Conditional Actions with <code>#event{}</code>
</li>
<li>
Postbacks

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> What is a Nitrogen Action? </h2>
<div class="outline-text-2" id="text-28">


</div>

<div id="outline-container-28_1" class="outline-3">
<h3 id="sec-28_1"><span class="section-number-3">28.1</span> Nitrogen Actions </h3>
<div class="outline-text-3" id="text-28_1">


</div>

<div id="outline-container-28_1_1" class="outline-4">
<h4 id="sec-28_1_1"><span class="section-number-4">28.1.1</span> What is a Nitrogen Action? </h4>
<div class="outline-text-4" id="text-28_1_1">

<p>An action can either be Javascript, or some record that renders
into Javascript.
</p>
<p>
Add a Javascript alert to the <code>#button{}</code> element. Then recompile
and run. What do you expect will happen?
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;
    [
        #<span style="color: #28439B;">button</span> { text=<span style="color: #09A240;">"Submit"</span>, actions=<span style="color: #09A240;">"alert('hello');"</span> }
    ].
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> What is a Nitrogen Action? </h2>
<div class="outline-text-2" id="text-29">


</div>

<div id="outline-container-29_1" class="outline-3">
<h3 id="sec-29_1"><span class="section-number-3">29.1</span> Nitrogen Actions </h3>
<div class="outline-text-3" id="text-29_1">


</div>

<div id="outline-container-29_1_1" class="outline-4">
<h4 id="sec-29_1_1"><span class="section-number-4">29.1.1</span> What is a Nitrogen Action? </h4>
<div class="outline-text-4" id="text-29_1_1">

<p>Do the same thing a different way.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;
    [
        #<span style="color: #28439B;">button</span> { 
            text=<span style="color: #09A240;">"Submit"</span>, 
            actions=#<span style="color: #28439B;">alert</span> { text=<span style="color: #09A240;">"Hello"</span> } 
        }
    ].
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> Wiring an Action </h2>
<div class="outline-text-2" id="text-30">


</div>

<div id="outline-container-30_1" class="outline-3">
<h3 id="sec-30_1"><span class="section-number-3">30.1</span> Nitrogen Actions </h3>
<div class="outline-text-3" id="text-30_1">


</div>

<div id="outline-container-30_1_1" class="outline-4">
<h4 id="sec-30_1_1"><span class="section-number-4">30.1.1</span> Wiring an Action </h4>
<div class="outline-text-4" id="text-30_1_1">


<p>
Setting the <code>actions</code> property of an element can lead to messy
code. Another, cleaner way to wire an action is the <code>wf:wire/N</code>
function.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(mybutton, #<span style="color: #28439B;">effect</span> { effect=pulsate }),
    [
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span> }
    ].
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> Conditional Actions with <code>#event{}</code> </h2>
<div class="outline-text-2" id="text-31">


</div>

<div id="outline-container-31_1" class="outline-3">
<h3 id="sec-31_1"><span class="section-number-3">31.1</span> Nitrogen Actions </h3>
<div class="outline-text-3" id="text-31_1">


</div>

<div id="outline-container-31_1_1" class="outline-4">
<h4 id="sec-31_1_1"><span class="section-number-4">31.1.1</span> Conditional Actions with <code>#event{}</code> </h4>
<div class="outline-text-4" id="text-31_1_1">


<p>
Put the <code>#effect{}</code> action inside of an <code>#event{}</code> action. This
causes the effect to <b>only</b> get fired if the user clicks on
<code>mybutton</code>.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(mybutton, #<span style="color: #28439B;">event</span> { 
        type=click, 
        actions=#<span style="color: #28439B;">effect</span> { effect=pulsate }
    }),
    [
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span> }
    ].
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> Triggers and Targets </h2>
<div class="outline-text-2" id="text-32">


</div>

<div id="outline-container-32_1" class="outline-3">
<h3 id="sec-32_1"><span class="section-number-3">32.1</span> Nitrogen Actions </h3>
<div class="outline-text-3" id="text-32_1">


</div>

<div id="outline-container-32_1_1" class="outline-4">
<h4 id="sec-32_1_1"><span class="section-number-4">32.1.1</span> Triggers and Targets </h4>
<div class="outline-text-4" id="text-32_1_1">


<p>
All actions have a <code>target</code> property. The <code>target</code> specifies what
element(s) the action effects.
</p>
<p>
The event action also has a <code>trigger</code> property. The <code>trigger</code>
specifies what element(s) trigger the action.
</p>
<p>
Try this:
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(#<span style="color: #28439B;">event</span> { 
        type=click, trigger=mybutton, target=mylabel,
        actions=#<span style="color: #28439B;">effect</span> { effect=pulsate }
    }),
    [
        #<span style="color: #28439B;">label</span> { id=mylabel, text=<span style="color: #09A240;">"Make Me Blink!"</span> },
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span> }
    ].
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> Triggers and Targets </h2>
<div class="outline-text-2" id="text-33">


</div>

<div id="outline-container-33_1" class="outline-3">
<h3 id="sec-33_1"><span class="section-number-3">33.1</span> Nitrogen Actions </h3>
<div class="outline-text-3" id="text-33_1">


</div>

<div id="outline-container-33_1_1" class="outline-4">
<h4 id="sec-33_1_1"><span class="section-number-4">33.1.1</span> Triggers and Targets </h4>
<div class="outline-text-4" id="text-33_1_1">


<p>
You can also specify the <b>Trigger</b> and <b>Target</b> directly in <code>wf:wire/N</code>. It takes three forms:
</p>



<pre class="src src-erlang"><span style="color: #929292;">% </span><span style="color: #929292;">Specify a trigger and target.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(<span style="color: #000000;">Trigger</span>, <span style="color: #000000;">Target</span>, <span style="color: #000000;">Actions</span>)

<span style="color: #929292;">% </span><span style="color: #929292;">Use the same element for both trigger and target.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(<span style="color: #000000;">TriggerAndTarget</span>, <span style="color: #000000;">Actions</span>)

<span style="color: #929292;">% </span><span style="color: #929292;">Assume the trigger and/or target is provided in the actions. 
</span><span style="color: #929292;">% </span><span style="color: #929292;">If not, then wire the action directly to the page. 
</span><span style="color: #929292;">% </span><span style="color: #929292;">(Useful for catching keystrokes.)
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(<span style="color: #000000;">Actions</span>)
</pre>



</div>
</div>
</div>

</div>
