doc/org-mode/tutorial.org
*** Quick Review

    1. Elements make HTML.
    2. Actions make Javascript.
    3. An action can be wired using the =actions= property, or wired
       later with =wf:wire/N=. Both approaches can take a single
       action or a list of actions.
    4. An action looks for =trigger= and =target= properties. These
       can be specified in a few different ways.
    5. Everything we have seen so far happens on the client.

* PART 5 AGENDA
** Nitrogen Events
   + What is a Postback?
   + Your First Postback
   + Event Properties
   + More Event Examples
   + Postback Shortcuts
   + Modifying Elements
* What is a Postback?
** Nitrogen Events
*** What is a Postback?
    
    A postback briefly transfers control from the browser to the
    Nitrogen server. It is initiated when an event fires with the
    =postback= property set. For example:

    #+BEGIN_SRC erlang
    #event { type=click, postback=my_click_event }
    #+END_SRC

    The postback tag can be any valid Erlang term. You use this to
    differentiate incoming events.

* Your First Postback
** Nitrogen Events
*** Your First Postback
    
    First, let's use the postback to print out a debug message.

    #+BEGIN_SRC erlang
    body() -> 
        wf:wire(mybutton, #event { type=click, postback=myevent }),
        [
            #button { id=mybutton, text="Submit" }
        ].

    event(myevent) ->
        ?PRINT({event, now()}).
    #+END_SRC

* Postback Shortcuts
** Nitrogen Events
*** Postback Shortcuts
    
    A few elements allow you to set the =postback= property as a
    shortcut to handle their most common events.
   
    | Element       | Shortcut Event |
    | =#button{}=   | click          |
    | =#textbox{}=  | enter key      |
    | =#checkbox{}= | click          |
    | =#dropdown{}= | change         |
    | =#password{}= | enter key      |

* Postback Shortcuts
** Nitrogen Events
*** Postback Shortcuts

    A few elements allow you to set the =postback= property as a
    shortcut to handle their most common events.

    The previous code, simplified:

    #+BEGIN_SRC erlang
    body() -> 
        [
            #button { id=mybutton, text="Submit", postback=myevent }
        ].

    event(myevent) ->
        ?PRINT({event, now()}).
    #+END_SRC

* More Event Examples
** Nitrogen Events
*** More Event Examples
    
    #+BEGIN_SRC erlang
    body() -> 
        % 'mouseover', 'click', and 'mouseout' are standard Javascript
        % events.
        wf:wire(mybutton, [
            #event { type=mouseover, postback=my_mouseover_event }
            #event { type=click, postback=my_click_event }
            #event { type=mouseout, postback=my_mouseout_event }
        ]),
        [
            #button { id=mybutton, text="Submit" }
        ].

    event(my_click_event) ->
        ?PRINT({click, now()});
    event(OtherEvent) ->
        ?PRINT({other, MyEvent, now()}).
    #+END_SRC
        
* More Event Examples
** Nitrogen Events
*** More Event Examples
    
    Generally, a postback is a good chance to read form elements. The
    =wf:q(ElementID)= function does this.

    #+BEGIN_SRC erlang
    body() -> 
        [
            #textbox { id=mytextbox, text="Edit this text." },
            #button { id=mybutton, text="Submit", postback=myevent }
        ].

    event(myevent) ->
        Text = wf:q(mytextbox),
        ?PRINT({event, Text}).
    #+END_SRC

* Modifying Elements
** Nitrogen Events
*** Modifying Elements

    Here is where everything comes together: we are going to modify
    the page from within a postback event. Nitrogen uses *AJAX* to
    update parts of a page without updating the entire page. 

    #+BEGIN_SRC erlang
    body() -> 
        #panel { style="margin: 50px;", body=[
            #button { id=mybutton, text="Submit", postback=click },
            #panel { id=placeholder }
        ]}.

    event(click) ->
        wf:update(placeholder, [
            #h1 { text="Congratulations!" },
            #p { body="You have updated the page!" },
            #p { body=io_lib:format("~p", [now()]) }
        ]).
    #+END_SRC

* More Page Manipulation
** Nitrogen Events
