doc/org-mode/tutorial.html

<div id="outline-container-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> Quick Review </h2>
<div class="outline-text-2" id="text-34">


</div>

<div id="outline-container-34_1" class="outline-3">
<h3 id="sec-34_1"><span class="section-number-3">34.1</span> Nitrogen Actions </h3>
<div class="outline-text-3" id="text-34_1">


</div>

<div id="outline-container-34_1_1" class="outline-4">
<h4 id="sec-34_1_1"><span class="section-number-4">34.1.1</span> Quick Review </h4>
<div class="outline-text-4" id="text-34_1_1">


<ol>
<li>
Elements make HTML.
</li>
<li>
Actions make Javascript.
</li>
<li>
An action can be wired using the <code>actions</code> property, or wired
later with <code>wf:wire/N</code>. Both approaches can take a single
action or a list of actions.
</li>
<li>
An action looks for <code>trigger</code> and <code>target</code> properties. These
can be specified in a few different ways.
</li>
<li>
Everything we have seen so far happens on the client.

</li>
</ol>
</div>
</div>
</div>

</div>

<div id="outline-container-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> PART 5 AGENDA </h2>
<div class="outline-text-2" id="text-35">


</div>

<div id="outline-container-35_1" class="outline-3">
<h3 id="sec-35_1"><span class="section-number-3">35.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-35_1">

<ul>
<li>
What is a Postback?
</li>
<li>
Your First Postback
</li>
<li>
Event Properties
</li>
<li>
More Event Examples
</li>
<li>
Postback Shortcuts
</li>
<li>
Modifying Elements
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> What is a Postback? </h2>
<div class="outline-text-2" id="text-36">


</div>

<div id="outline-container-36_1" class="outline-3">
<h3 id="sec-36_1"><span class="section-number-3">36.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-36_1">


</div>

<div id="outline-container-36_1_1" class="outline-4">
<h4 id="sec-36_1_1"><span class="section-number-4">36.1.1</span> What is a Postback? </h4>
<div class="outline-text-4" id="text-36_1_1">


<p>
A postback briefly transfers control from the browser to the
Nitrogen server. It is initiated when an event fires with the
<code>postback</code> property set. For example:
</p>



<pre class="src src-erlang">#<span style="color: #28439B;">event</span> { type=click, postback=my_click_event }
</pre>



<p>
The postback tag can be any valid Erlang term. You use this to
differentiate incoming events.
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> Your First Postback </h2>
<div class="outline-text-2" id="text-37">


</div>

<div id="outline-container-37_1" class="outline-3">
<h3 id="sec-37_1"><span class="section-number-3">37.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-37_1">


</div>

<div id="outline-container-37_1_1" class="outline-4">
<h4 id="sec-37_1_1"><span class="section-number-4">37.1.1</span> Your First Postback </h4>
<div class="outline-text-4" id="text-37_1_1">


<p>
First, let's use the postback to print out a debug message.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(mybutton, #<span style="color: #28439B;">event</span> { type=click, postback=myevent }),
    [
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span> }
    ].

<span style="color: #28439B;">event</span>(myevent) -&gt;
    ?<span style="color: #28439B;">PRINT</span>({event, <span style="color: #000000;">now</span>()}).
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> Postback Shortcuts </h2>
<div class="outline-text-2" id="text-38">


</div>

<div id="outline-container-38_1" class="outline-3">
<h3 id="sec-38_1"><span class="section-number-3">38.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-38_1">


</div>

<div id="outline-container-38_1_1" class="outline-4">
<h4 id="sec-38_1_1"><span class="section-number-4">38.1.1</span> Postback Shortcuts </h4>
<div class="outline-text-4" id="text-38_1_1">


<p>
A few elements allow you to set the <code>postback</code> property as a
shortcut to handle their most common events.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>Element</td><td>Shortcut Event</td></tr>
<tr><td><code>#button{}</code></td><td>click</td></tr>
<tr><td><code>#textbox{}</code></td><td>enter key</td></tr>
<tr><td><code>#checkbox{}</code></td><td>click</td></tr>
<tr><td><code>#dropdown{}</code></td><td>change</td></tr>
<tr><td><code>#password{}</code></td><td>enter key</td></tr>
</tbody>
</table>


</div>
</div>
</div>

</div>

<div id="outline-container-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> Postback Shortcuts </h2>
<div class="outline-text-2" id="text-39">


</div>

<div id="outline-container-39_1" class="outline-3">
<h3 id="sec-39_1"><span class="section-number-3">39.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-39_1">


</div>

<div id="outline-container-39_1_1" class="outline-4">
<h4 id="sec-39_1_1"><span class="section-number-4">39.1.1</span> Postback Shortcuts </h4>
<div class="outline-text-4" id="text-39_1_1">


<p>
A few elements allow you to set the <code>postback</code> property as a
shortcut to handle their most common events.
</p>
<p>
The previous code, simplified:
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    [
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span>, postback=myevent }
    ].

<span style="color: #28439B;">event</span>(myevent) -&gt;
    ?<span style="color: #28439B;">PRINT</span>({event, <span style="color: #000000;">now</span>()}).
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> More Event Examples </h2>
<div class="outline-text-2" id="text-40">


</div>

<div id="outline-container-40_1" class="outline-3">
<h3 id="sec-40_1"><span class="section-number-3">40.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-40_1">


</div>

<div id="outline-container-40_1_1" class="outline-4">
<h4 id="sec-40_1_1"><span class="section-number-4">40.1.1</span> More Event Examples </h4>
<div class="outline-text-4" id="text-40_1_1">





<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #929292;">% </span><span style="color: #929292;">'mouseover', 'click', and 'mouseout' are standard Javascript
</span>    <span style="color: #929292;">% </span><span style="color: #929292;">events.
</span>    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(mybutton, [
        #<span style="color: #28439B;">event</span> { type=mouseover, postback=my_mouseover_event }
        #<span style="color: #28439B;">event</span> { type=click, postback=my_click_event }
        #<span style="color: #28439B;">event</span> { type=mouseout, postback=my_mouseout_event }
    ]),
    [
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span> }
    ].

<span style="color: #28439B;">event</span>(my_click_event) -&gt;
    ?<span style="color: #28439B;">PRINT</span>({click, <span style="color: #000000;">now</span>()});
<span style="color: #28439B;">event</span>(<span style="color: #000000;">OtherEvent</span>) -&gt;
    ?<span style="color: #28439B;">PRINT</span>({other, <span style="color: #000000;">MyEvent</span>, <span style="color: #000000;">now</span>()}).
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> More Event Examples </h2>
<div class="outline-text-2" id="text-41">


</div>

<div id="outline-container-41_1" class="outline-3">
<h3 id="sec-41_1"><span class="section-number-3">41.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-41_1">


</div>

<div id="outline-container-41_1_1" class="outline-4">
<h4 id="sec-41_1_1"><span class="section-number-4">41.1.1</span> More Event Examples </h4>
<div class="outline-text-4" id="text-41_1_1">


<p>
Generally, a postback is a good chance to read form elements. The
<code>wf:q(ElementID)</code> function does this.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    [
        #<span style="color: #28439B;">textbox</span> { id=mytextbox, text=<span style="color: #09A240;">"Edit this text."</span> },
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span>, postback=myevent }
    ].

<span style="color: #28439B;">event</span>(myevent) -&gt;
    <span style="color: #000000;">Text</span> = <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">q</span>(mytextbox),
    ?<span style="color: #28439B;">PRINT</span>({event, <span style="color: #000000;">Text</span>}).
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> Modifying Elements </h2>
<div class="outline-text-2" id="text-42">


</div>

<div id="outline-container-42_1" class="outline-3">
<h3 id="sec-42_1"><span class="section-number-3">42.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-42_1">


</div>

<div id="outline-container-42_1_1" class="outline-4">
<h4 id="sec-42_1_1"><span class="section-number-4">42.1.1</span> Modifying Elements </h4>
<div class="outline-text-4" id="text-42_1_1">


<p>
Here is where everything comes together: we are going to modify
the page from within a postback event. Nitrogen uses <b>AJAX</b> to
update parts of a page without updating the entire page. 
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    #<span style="color: #28439B;">panel</span> { style=<span style="color: #09A240;">"margin: 50px;"</span>, body=[
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span>, postback=click },
        #<span style="color: #28439B;">panel</span> { id=placeholder }
    ]}.

<span style="color: #28439B;">event</span>(click) -&gt;
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">update</span>(placeholder, [
        #<span style="color: #28439B;">h1</span> { text=<span style="color: #09A240;">"Congratulations!"</span> },
        #<span style="color: #28439B;">p</span> { body=<span style="color: #09A240;">"You have updated the page!"</span> },
        #<span style="color: #28439B;">p</span> { body=<span style="color: #28439B;">io_lib</span>:<span style="color: #28439B;">format</span>(<span style="color: #09A240;">"~p"</span>, [<span style="color: #000000;">now</span>()]) }
    ]).
</pre>



</div>
</div>
</div>

</div>
