doc/org-mode/tutorial.org
*** More Page Manipulation

    The =wf= module exposes many manipulation functions:

    + =wf:update/2= :: Update the contents of an element with another element(s).
    + =wf:insert_top/2= :: Insert a new element(s) at the beginning of another element.
    + =wf:insert_bottom/2= :: Insert a new element(s) at the bottom of another element.
    + =wf:replace/2= :: Replace an element with another element.
    + =wf:remove/1= :: Remove an element(s).
    + =wf:set/2= :: Set a textbox or checkbox value.

    It also exposes many other generally useful utility functions:
    [[http://nitrogenproject.com/doc/api.html]]
                       
* PART 6 AGENDA
** Remembering State
   + Page State vs. Session State
   + Page State Example
   + Session State Example
* Page State vs. Session State
** Remembering State
*** Page State vs. Session State

    Nitrogen can store two kinds of state:

    + *Page State*
      + Stored in a user's browser window. 
      + Destroyed when the user closes the window or navigates to a
        different page.
      + Sent across the wire with each request.

    + *Session State*
      + Stored in server memory. 
      + Destroyed when the session expires or the Erlang VM dies.
      + Associated with the user's session by an HTTP cookie.
      + Useful place to store authentication

* Page State
** Remembering State
*** Page State

    Using Page State:
    
    #+BEGIN_SRC erlang
    % Set a state variable
    wf:state(Key, Value)

    % Get a state variable
    wf:state(Key)
    wf:state_default(Key, DefaultValue)
    #+END_SRC

    =Key= and =Value= can be any valid Erlang term.

    *Exercise:* Modify my\_page.erl to display a counter that gets
    incremented every time you press the 'Submit' button. The counter
    should reset when the user reloads the page.

* Page State
** Remembering State
*** Page State

    #+BEGIN_SRC erlang
    body() ->
        #panel { style="margin: 50px;", body=[
            #button { id=mybutton, text="Submit", postback=click },
            #panel { id=placeholder, body="1" }
        ]}.
     
    event(click) ->
        Counter = wf:state_default(counter, 1),
        wf:update(placeholder, [
            #panel { body=io_lib:format("~p", [Counter + 1]) }
        ]),
        wf:state(counter, Counter + 1).
    #+END_SRC

* Session State
** Remembering State
*** Session State

    Using Session State:
    
    #+BEGIN_SRC erlang
    % Set a session state variable
    wf:session(Key, Value)

    % Get a session state variable
    wf:session(Key)
    wf:session_default(Key, DefaultValue)
    #+END_SRC

    =Key= and =Value= can be any valid Erlang term.

    *Exercise:* Modify my\_page.erl to display *TWO* counters. When the
    user presses the 'Submit' button, one counter should get
    incremented, the other counter should get doubled. The server
    should remember the counter even if the closes and then re-opens
    the browser.

* Session State
** Remembering State
*** Session State
    #+BEGIN_SRC erlang
    body() ->
        #panel { style="margin: 50px;", body=[
            #button { id=mybutton, text="Submit", postback=click },
            #panel { id=placeholder1, body="1" },
            #panel { id=placeholder2, body="1" }
        ]}.
     
    event(click) ->
        %% Increment the counter...
        Counter1 = wf:session_default(counter1, 1),
        wf:update(placeholder1, io_lib:format("~p", [Counter1 + 1])),
        wf:session(counter1, Counter1 + 1),
     
        %% Double the other counter...
        Counter2 = wf:session_default(counter2, 1),
        wf:update(placeholder2, io_lib:format("~p", [Counter2 * 2])),
        wf:session(counter2, Counter2 * 2).
    #+END_SRC

* PART 7 AGENDA
** Security
   + Limiting Access to a Page
   + Authentication and Authorization Functions
   + Page Redirection Functions
   + Creating a Secure Page
* Limiting Access to a Page
** Security
