doc/org-mode/tutorial.html

<div id="outline-container-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> More Page Manipulation </h2>
<div class="outline-text-2" id="text-43">


</div>

<div id="outline-container-43_1" class="outline-3">
<h3 id="sec-43_1"><span class="section-number-3">43.1</span> Nitrogen Events </h3>
<div class="outline-text-3" id="text-43_1">


</div>

<div id="outline-container-43_1_1" class="outline-4">
<h4 id="sec-43_1_1"><span class="section-number-4">43.1.1</span> More Page Manipulation </h4>
<div class="outline-text-4" id="text-43_1_1">


<p>
The <code>wf</code> module exposes many manipulation functions:
</p>
<dl>
<dt><code>wf:update/2</code></dt><dd>
Update the contents of an element with another element(s).
</dd>
<dt><code>wf:insert_top/2</code></dt><dd>
Insert a new element(s) at the beginning of another element.
</dd>
<dt><code>wf:insert_bottom/2</code></dt><dd>
Insert a new element(s) at the bottom of another element.
</dd>
<dt><code>wf:replace/2</code></dt><dd>
Replace an element with another element.
</dd>
<dt><code>wf:remove/1</code></dt><dd>
Remove an element(s).
</dd>
<dt><code>wf:set/2</code></dt><dd>
Set a textbox or checkbox value.

</dd>
</dl>

<p>It also exposes many other generally useful utility functions:
<a href="http://nitrogenproject.com/doc/api.html">http://nitrogenproject.com/doc/api.html</a>
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> PART 6 AGENDA </h2>
<div class="outline-text-2" id="text-44">


</div>

<div id="outline-container-44_1" class="outline-3">
<h3 id="sec-44_1"><span class="section-number-3">44.1</span> Remembering State </h3>
<div class="outline-text-3" id="text-44_1">

<ul>
<li>
Page State vs. Session State
</li>
<li>
Page State Example
</li>
<li>
Session State Example
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> Page State vs. Session State </h2>
<div class="outline-text-2" id="text-45">


</div>

<div id="outline-container-45_1" class="outline-3">
<h3 id="sec-45_1"><span class="section-number-3">45.1</span> Remembering State </h3>
<div class="outline-text-3" id="text-45_1">


</div>

<div id="outline-container-45_1_1" class="outline-4">
<h4 id="sec-45_1_1"><span class="section-number-4">45.1.1</span> Page State vs. Session State </h4>
<div class="outline-text-4" id="text-45_1_1">


<p>
Nitrogen can store two kinds of state:
</p>
<ul>
<li>
<b>Page State</b>
<ul>
<li>
Stored in a user's browser window. 
</li>
<li>
Destroyed when the user closes the window or navigates to a
different page.
</li>
<li>
Sent across the wire with each request.

</li>
</ul>
</li>
<li>
<b>Session State</b>
<ul>
<li>
Stored in server memory. 
</li>
<li>
Destroyed when the session expires or the Erlang VM dies.
</li>
<li>
Associated with the user's session by an HTTP cookie.
</li>
<li>
Useful place to store authentication

</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> Page State </h2>
<div class="outline-text-2" id="text-46">


</div>

<div id="outline-container-46_1" class="outline-3">
<h3 id="sec-46_1"><span class="section-number-3">46.1</span> Remembering State </h3>
<div class="outline-text-3" id="text-46_1">


</div>

<div id="outline-container-46_1_1" class="outline-4">
<h4 id="sec-46_1_1"><span class="section-number-4">46.1.1</span> Page State </h4>
<div class="outline-text-4" id="text-46_1_1">


<p>
Using Page State:
</p>



<pre class="src src-erlang"><span style="color: #929292;">% </span><span style="color: #929292;">Set a state variable
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">state</span>(<span style="color: #000000;">Key</span>, <span style="color: #000000;">Value</span>)

<span style="color: #929292;">% </span><span style="color: #929292;">Get a state variable
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">state</span>(<span style="color: #000000;">Key</span>)
<span style="color: #28439B;">wf</span>:<span style="color: #28439B;">state_default</span>(<span style="color: #000000;">Key</span>, <span style="color: #000000;">DefaultValue</span>)
</pre>



<p>
<code>Key</code> and <code>Value</code> can be any valid Erlang term.
</p>
<p>
<b>Exercise:</b> Modify my_page.erl to display a counter that gets
incremented every time you press the 'Submit' button. The counter
should reset when the user reloads the page.
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> Page State </h2>
<div class="outline-text-2" id="text-47">


</div>

<div id="outline-container-47_1" class="outline-3">
<h3 id="sec-47_1"><span class="section-number-3">47.1</span> Remembering State </h3>
<div class="outline-text-3" id="text-47_1">


</div>

<div id="outline-container-47_1_1" class="outline-4">
<h4 id="sec-47_1_1"><span class="section-number-4">47.1.1</span> Page State </h4>
<div class="outline-text-4" id="text-47_1_1">





<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;
    #<span style="color: #28439B;">panel</span> { style=<span style="color: #09A240;">"margin: 50px;"</span>, body=[
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span>, postback=click },
        #<span style="color: #28439B;">panel</span> { id=placeholder, body=<span style="color: #09A240;">"1"</span> }
    ]}.

<span style="color: #28439B;">event</span>(click) -&gt;
    <span style="color: #000000;">Counter</span> = <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">state_default</span>(counter, 1),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">update</span>(placeholder, [
        #<span style="color: #28439B;">panel</span> { body=<span style="color: #28439B;">io_lib</span>:<span style="color: #28439B;">format</span>(<span style="color: #09A240;">"~p"</span>, [<span style="color: #000000;">Counter</span> + 1]) }
    ]),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">state</span>(counter, <span style="color: #000000;">Counter</span> + 1).
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> Session State </h2>
<div class="outline-text-2" id="text-48">


</div>

<div id="outline-container-48_1" class="outline-3">
<h3 id="sec-48_1"><span class="section-number-3">48.1</span> Remembering State </h3>
<div class="outline-text-3" id="text-48_1">


</div>

<div id="outline-container-48_1_1" class="outline-4">
<h4 id="sec-48_1_1"><span class="section-number-4">48.1.1</span> Session State </h4>
<div class="outline-text-4" id="text-48_1_1">


<p>
Using Session State:
</p>



<pre class="src src-erlang"><span style="color: #929292;">% </span><span style="color: #929292;">Set a session state variable
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">session</span>(<span style="color: #000000;">Key</span>, <span style="color: #000000;">Value</span>)

<span style="color: #929292;">% </span><span style="color: #929292;">Get a session state variable
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">session</span>(<span style="color: #000000;">Key</span>)
<span style="color: #28439B;">wf</span>:<span style="color: #28439B;">session_default</span>(<span style="color: #000000;">Key</span>, <span style="color: #000000;">DefaultValue</span>)
</pre>



<p>
<code>Key</code> and <code>Value</code> can be any valid Erlang term.
</p>
<p>
<b>Exercise:</b> Modify my_page.erl to display <b>TWO</b> counters. When the
user presses the 'Submit' button, one counter should get
incremented, the other counter should get doubled. The server
should remember the counter even if the closes and then re-opens
the browser.
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> Session State </h2>
<div class="outline-text-2" id="text-49">


</div>

<div id="outline-container-49_1" class="outline-3">
<h3 id="sec-49_1"><span class="section-number-3">49.1</span> Remembering State </h3>
<div class="outline-text-3" id="text-49_1">


</div>

<div id="outline-container-49_1_1" class="outline-4">
<h4 id="sec-49_1_1"><span class="section-number-4">49.1.1</span> Session State </h4>
<div class="outline-text-4" id="text-49_1_1">




<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;
    #<span style="color: #28439B;">panel</span> { style=<span style="color: #09A240;">"margin: 50px;"</span>, body=[
        #<span style="color: #28439B;">button</span> { id=mybutton, text=<span style="color: #09A240;">"Submit"</span>, postback=click },
        #<span style="color: #28439B;">panel</span> { id=placeholder1, body=<span style="color: #09A240;">"1"</span> },
        #<span style="color: #28439B;">panel</span> { id=placeholder2, body=<span style="color: #09A240;">"1"</span> }
    ]}.

<span style="color: #28439B;">event</span>(click) -&gt;
    <span style="color: #929292;">%% </span><span style="color: #929292;">Increment the counter...
</span>    <span style="color: #000000;">Counter1</span> = <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">session_default</span>(counter1, 1),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">update</span>(placeholder1, <span style="color: #28439B;">io_lib</span>:<span style="color: #28439B;">format</span>(<span style="color: #09A240;">"~p"</span>, [<span style="color: #000000;">Counter1</span> + 1])),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">session</span>(counter1, <span style="color: #000000;">Counter1</span> + 1),

    <span style="color: #929292;">%% </span><span style="color: #929292;">Double the other counter...
</span>    <span style="color: #000000;">Counter2</span> = <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">session_default</span>(counter2, 1),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">update</span>(placeholder2, <span style="color: #28439B;">io_lib</span>:<span style="color: #28439B;">format</span>(<span style="color: #09A240;">"~p"</span>, [<span style="color: #000000;">Counter2</span> * 2])),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">session</span>(counter2, <span style="color: #000000;">Counter2</span> * 2).
</pre>



</div>
</div>
</div>

</div>
