doc/org-mode/tutorial.org
*** Limiting Access to a Page

    Nitrogen contains functions to help you build password protected websites:
    
    + Nitrogen is built for role-based security. You set the roles for
      a current session, and check those roles later.

      For example, the user may have the =friend= and =manager=
       roles, but not the =administrator= role.

    + Authentication/authorization info is stored in the session. 
   
* Authentication and Authorization Functions
** Security
*** Authentication and Authorization Functions

    Functions to set the user/role:

    #+BEGIN_SRC erlang
    % Get/set the current user for this session.
    wf:user(), wf:user(User)
    
    % Get/set whether the current session has the specified role.
    wf:role(Role), wf:role(Role, IsInRole)
    #+END_SRC
    
* Page Redirection Functions
** Security
*** Page Redirection Functions

    Functions kick the user to a login page:

    #+BEGIN_SRC erlang
    % Redirect the user to a different page.
    wf:redirect(Url)
    
    % Redirect the user to the login page.
    wf:redirect_to_login(LoginUrl)
    
    % Redirect the user back to the original page they 
    % tried to access.  
    wf:redirect_from_login(DefaultUrl)
    #+END_SRC

* Creating a Secure Page - Step 1
** Security
*** Creating a Secure Page - Step 1
    
    Check for the =managers= role at the top of a page. If the user
    doesn't have the role, go to a login page.

    #+BEGIN_SRC erlang
    main() -> 
        case wf:role(managers) of
            true ->
                #template { file="./site/templates/bare.html" };
            false ->
                wf:redirect_to_login("/login")
        end.
    #+END_SRC

* Creating a Secure Page - Step 2
** Security
*** Creating a Secure Page - Step 2

    Create a login page. For now, just create a button that, when
    clicked, grants the =managers= role to the user and redirects
    back.

    #+BEGIN_SRC erlang
    body() ->
        #button { text="Login", postback=login }.

    event(login) ->
        wf:role(managers, true),
        wf:redirect_from_login("/").
    #+END_SRC

* Creating a Secure Page - Step 3
** Security
*** Creating a Secure Page - Step 3
    
    Update =login.erl= to prompt for a username and password.

    #+BEGIN_SRC erlang
    body() -> 
        #panel { style="margin: 50px;", body=[
            #flash {},
            #label { text="Username" },
            #textbox { id=username, next=password },
            #br {},
            #label { text="Password" },
            #password { id=password, next=submit },
            #br {},
            #button { text="Login", id=submit, postback=login }
        ]}.
     
    event(login) ->
        case wf:q(password) == "password" of
            true ->
                wf:role(managers, true),
                wf:redirect_from_login("/");
            false ->
                wf:flash("Invalid password.")
        end.
    #+END_SRC
    
* Creating a Secure Page - Step 4
** Security
*** Creating a Secure Page - Step 4
    
    Create a way for the user to logout.

    #+BEGIN_SRC erlang
    % Clears all user, roles, session state, and page state.
    wf:logout()
    #+END_SRC

    /Note: Placing this statement appropriately is left as an exercise for the reader./

* PART 8 AGENDA
** Validation
   + Overview of Nitrogen Validation
   + Adding Some Validators

* Overview of Nitrogen Validation
** Validation
*** Overview of Nitrogen Validation
    
    Nitrogen implements a validation framework, plus a number of
    pre-built validators, to allow you to declaratively validate your
    form variables.

    Validation happens on both client side (using the LiveValidation
    library) and server side (in Erlang). 

    This is done to present a responsive front end to the user 

