doc/org-mode/tutorial.html

<div id="outline-container-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> PART 7 AGENDA </h2>
<div class="outline-text-2" id="text-50">


</div>

<div id="outline-container-50_1" class="outline-3">
<h3 id="sec-50_1"><span class="section-number-3">50.1</span> Security </h3>
<div class="outline-text-3" id="text-50_1">

<ul>
<li>
Limiting Access to a Page
</li>
<li>
Authentication and Authorization Functions
</li>
<li>
Page Redirection Functions
</li>
<li>
Creating a Secure Page
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> Limiting Access to a Page </h2>
<div class="outline-text-2" id="text-51">


</div>

<div id="outline-container-51_1" class="outline-3">
<h3 id="sec-51_1"><span class="section-number-3">51.1</span> Security </h3>
<div class="outline-text-3" id="text-51_1">


</div>

<div id="outline-container-51_1_1" class="outline-4">
<h4 id="sec-51_1_1"><span class="section-number-4">51.1.1</span> Limiting Access to a Page </h4>
<div class="outline-text-4" id="text-51_1_1">


<p>
Nitrogen contains functions to help you build password protected websites:
</p>
<ul>
<li>
Nitrogen is built for role-based security. You set the roles for
a current session, and check those roles later.

<p>
For example, the user may have the <code>friend</code> and <code>manager</code>
roles, but not the <code>administrator</code> role.
</p>
</li>
<li>
Authentication/authorization info is stored in the session. 

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> Authentication and Authorization Functions </h2>
<div class="outline-text-2" id="text-52">


</div>

<div id="outline-container-52_1" class="outline-3">
<h3 id="sec-52_1"><span class="section-number-3">52.1</span> Security </h3>
<div class="outline-text-3" id="text-52_1">


</div>

<div id="outline-container-52_1_1" class="outline-4">
<h4 id="sec-52_1_1"><span class="section-number-4">52.1.1</span> Authentication and Authorization Functions </h4>
<div class="outline-text-4" id="text-52_1_1">


<p>
Functions to set the user/role:
</p>



<pre class="src src-erlang"><span style="color: #929292;">% </span><span style="color: #929292;">Get/set the current user for this session.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">user</span>(), <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">user</span>(<span style="color: #000000;">User</span>)

<span style="color: #929292;">% </span><span style="color: #929292;">Get/set whether the current session has the specified role.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">role</span>(<span style="color: #000000;">Role</span>), <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">role</span>(<span style="color: #000000;">Role</span>, <span style="color: #000000;">IsInRole</span>)
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> Page Redirection Functions </h2>
<div class="outline-text-2" id="text-53">


</div>

<div id="outline-container-53_1" class="outline-3">
<h3 id="sec-53_1"><span class="section-number-3">53.1</span> Security </h3>
<div class="outline-text-3" id="text-53_1">


</div>

<div id="outline-container-53_1_1" class="outline-4">
<h4 id="sec-53_1_1"><span class="section-number-4">53.1.1</span> Page Redirection Functions </h4>
<div class="outline-text-4" id="text-53_1_1">


<p>
Functions kick the user to a login page:
</p>



<pre class="src src-erlang"><span style="color: #929292;">% </span><span style="color: #929292;">Redirect the user to a different page.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">redirect</span>(<span style="color: #000000;">Url</span>)

<span style="color: #929292;">% </span><span style="color: #929292;">Redirect the user to the login page.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">redirect_to_login</span>(<span style="color: #000000;">LoginUrl</span>)

<span style="color: #929292;">% </span><span style="color: #929292;">Redirect the user back to the original page they 
</span><span style="color: #929292;">% </span><span style="color: #929292;">tried to access.  
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">redirect_from_login</span>(<span style="color: #000000;">DefaultUrl</span>)
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> Creating a Secure Page - Step 1 </h2>
<div class="outline-text-2" id="text-54">


</div>

<div id="outline-container-54_1" class="outline-3">
<h3 id="sec-54_1"><span class="section-number-3">54.1</span> Security </h3>
<div class="outline-text-3" id="text-54_1">


</div>

<div id="outline-container-54_1_1" class="outline-4">
<h4 id="sec-54_1_1"><span class="section-number-4">54.1.1</span> Creating a Secure Page - Step 1 </h4>
<div class="outline-text-4" id="text-54_1_1">


<p>
Check for the <code>managers</code> role at the top of a page. If the user
doesn't have the role, go to a login page.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">main</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #FB5D17;">case</span> <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">role</span>(managers) <span style="color: #FB5D17;">of</span>
        true -&gt;
            #<span style="color: #28439B;">template</span> { file=<span style="color: #09A240;">"./site/templates/bare.html"</span> };
        false -&gt;
            <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">redirect_to_login</span>(<span style="color: #09A240;">"/login"</span>)
    <span style="color: #FB5D17;">end</span>.
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> Creating a Secure Page - Step 2 </h2>
<div class="outline-text-2" id="text-55">


</div>

<div id="outline-container-55_1" class="outline-3">
<h3 id="sec-55_1"><span class="section-number-3">55.1</span> Security </h3>
<div class="outline-text-3" id="text-55_1">


</div>

<div id="outline-container-55_1_1" class="outline-4">
<h4 id="sec-55_1_1"><span class="section-number-4">55.1.1</span> Creating a Secure Page - Step 2 </h4>
<div class="outline-text-4" id="text-55_1_1">


<p>
Create a login page. For now, just create a button that, when
clicked, grants the <code>managers</code> role to the user and redirects
back.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;
    #<span style="color: #28439B;">button</span> { text=<span style="color: #09A240;">"Login"</span>, postback=login }.

<span style="color: #28439B;">event</span>(login) -&gt;
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">role</span>(managers, true),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">redirect_from_login</span>(<span style="color: #09A240;">"/"</span>).
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> Creating a Secure Page - Step 3 </h2>
<div class="outline-text-2" id="text-56">


</div>

<div id="outline-container-56_1" class="outline-3">
<h3 id="sec-56_1"><span class="section-number-3">56.1</span> Security </h3>
<div class="outline-text-3" id="text-56_1">


</div>

<div id="outline-container-56_1_1" class="outline-4">
<h4 id="sec-56_1_1"><span class="section-number-4">56.1.1</span> Creating a Secure Page - Step 3 </h4>
<div class="outline-text-4" id="text-56_1_1">


<p>
Update <code>login.erl</code> to prompt for a username and password.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    #<span style="color: #28439B;">panel</span> { style=<span style="color: #09A240;">"margin: 50px;"</span>, body=[
        #<span style="color: #28439B;">flash</span> {},
        #<span style="color: #28439B;">label</span> { text=<span style="color: #09A240;">"Username"</span> },
        #<span style="color: #28439B;">textbox</span> { id=username, next=password },
        #<span style="color: #28439B;">br</span> {},
        #<span style="color: #28439B;">label</span> { text=<span style="color: #09A240;">"Password"</span> },
        #<span style="color: #28439B;">password</span> { id=password, next=submit },
        #<span style="color: #28439B;">br</span> {},
        #<span style="color: #28439B;">button</span> { text=<span style="color: #09A240;">"Login"</span>, id=submit, postback=login }
    ]}.

<span style="color: #28439B;">event</span>(login) -&gt;
    <span style="color: #FB5D17;">case</span> <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">q</span>(password) == <span style="color: #09A240;">"password"</span> <span style="color: #FB5D17;">of</span>
        true -&gt;
            <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">role</span>(managers, true),
            <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">redirect_from_login</span>(<span style="color: #09A240;">"/"</span>);
        false -&gt;
            <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">flash</span>(<span style="color: #09A240;">"Invalid password."</span>)
    <span style="color: #FB5D17;">end</span>.
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> Creating a Secure Page - Step 4 </h2>
<div class="outline-text-2" id="text-57">


</div>

<div id="outline-container-57_1" class="outline-3">
<h3 id="sec-57_1"><span class="section-number-3">57.1</span> Security </h3>
<div class="outline-text-3" id="text-57_1">


</div>

<div id="outline-container-57_1_1" class="outline-4">
<h4 id="sec-57_1_1"><span class="section-number-4">57.1.1</span> Creating a Secure Page - Step 4 </h4>
<div class="outline-text-4" id="text-57_1_1">


<p>
Create a way for the user to logout.
</p>



<pre class="src src-erlang"><span style="color: #929292;">% </span><span style="color: #929292;">Clears all user, roles, session state, and page state.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">logout</span>()
</pre>



<p>
<i>Note: Placing this statement appropriately is left as an exercise for the reader.</i>
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> PART 8 AGENDA </h2>
<div class="outline-text-2" id="text-58">


</div>

<div id="outline-container-58_1" class="outline-3">
<h3 id="sec-58_1"><span class="section-number-3">58.1</span> Validation </h3>
<div class="outline-text-3" id="text-58_1">

<ul>
<li>
Overview of Nitrogen Validation
</li>
<li>
Adding Some Validators

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> Overview of Nitrogen Validation </h2>
<div class="outline-text-2" id="text-59">


</div>

<div id="outline-container-59_1" class="outline-3">
<h3 id="sec-59_1"><span class="section-number-3">59.1</span> Validation </h3>
<div class="outline-text-3" id="text-59_1">


</div>

<div id="outline-container-59_1_1" class="outline-4">
<h4 id="sec-59_1_1"><span class="section-number-4">59.1.1</span> Overview of Nitrogen Validation </h4>
<div class="outline-text-4" id="text-59_1_1">


<p>
Nitrogen implements a validation framework, plus a number of
pre-built validators, to allow you to declaratively validate your
form variables.
</p>
<p>
Validation happens on both client side (using the LiveValidation
library) and server side (in Erlang). 
</p>
<p>
This is done to present a responsive front end to the user 
</p>
</div>
</div>
</div>

</div>
