doc/org-mode/tutorial.org
* Overview of Nitrogen Validation
** Validation
*** Overview of Nitrogen Validation

    The simplest validator is the =#is_required{}= validator. Tell your
    =login.erl= page to make sure the user enters both a username and
    a password.
    
    #+BEGIN_SRC erlang
    body() -> 
        wf:wire(submit, username, #validate { validators=[
            #is_required { text="Required." }
        ]}),
        wf:wire(submit, password, #validate { validators=[
            #is_required { text="Required." }
        ]}),
        #panel { style="margin: 50px;", body=[
            ...
    #+END_SRC

* Overview of Nitrogen Validation
** Validation
*** Overview of Nitrogen Validation

    We can get clever and use a validator to check that the user
    entered the correct password. The =#custom{}= validator runs on
    the server. (To make a custom client-side validator, use
    =#js_custom{}=.)
    
    #+BEGIN_SRC erlang
    body() -> 
        wf:wire(submit, username, #validate { validators=[
            #is_required { text="Required." }
        ]}),
        wf:wire(submit, password, #validate { validators=[
            #is_required { text="Required." },
            #custom { 
                text="Invalid password.", 
                function=fun(_, Value) -> Value == "password" end
            }
        ]}),
        #panel { style="margin: 50px;", body=[
            ...
    #+END_SRC

* Overview of Nitrogen Validation
** Validation
*** Overview of Nitrogen Validation

    Since we validate the password in the =#custom= validator, we can
    trust that the =login= event only fires when the password is
    correct. Change the =login= event to:
    
    #+BEGIN_SRC erlang
    event(login) ->
        wf:role(managers, true),
        wf:redirect_from_login("/").
    #+END_SRC

* PART 9 AGENDA
** Comet
   + What is Comet?
   + Comet the Nitrogen/Erlang Way
   + A Comet Counter
   + Comet Pools
   + Comet Pool Scope
   + The Simplest Chatroom Ever Constructed

* What is Comet?
** Comet
*** What is Comet?

    *Comet* is the name for a technique where the browser requests
    something from the server, and the server doesn't respond until
    it has something useful to say.

    This makes it useful for applications that need fast, out-of-band
    communication, such as chat rooms. 
    
    In other words, you don't need to keep hitting a "Get Messages"
    button. The server just pushes messages when they are available.

    /A big happy shout out to Tom McNulty for his innovative ideas on what
    Comet support could look like in Nitrogen./
     
* Comet the Nitrogen/Erlang Way
** Comet
*** Comet the Nitrogen/Erlang Way

    Think of Comet like =erlang:spawn/1=:

    + Start up a function.

    + The function can manipulate the page using =wf:update/2= or any
      other page manipulation function.

    + Output is queued until the function ends or calls =wf:flush/0=.

    + The function acts like it is linked to the current user's
      page. It is killed when the user leaves the page (or receives
      ={'EXIT', _, Message}= if =trap_exit= is =true=.)

* A Comet Counter
** Comet
*** A Comet Counter

    Update =my_page.erl= to count once per second.

    #+BEGIN_SRC erlang
    body() -> 
        wf:comet(fun() -> counter(1) end),
        #panel { id=placeholder }.

    counter(Count) ->
        timer:sleep(1000),
        wf:update(placeholder, integer_to_list(Count)),
        wf:flush(),
        counter(Count + 1).
    #+END_SRC 
        
* Comet Pools
** Comet
*** Comet Pools

    You can tell a Comet function to start in a pool by providing a
    =PoolName=. The =PoolName= can be any Erlang term.

    #+BEGIN_SRC erlang
    wf:comet(Fun, PoolName)
    #+END_SRC

    Now you can send messages to the pool. The messages will be
    received by other functions started in that comet pool.

    #+BEGIN_SRC erlang
    wf:send(PoolName, Message)
    #+END_SRC

* Comet Pool Scope
** Comet
