doc/org-mode/tutorial.html

<div id="outline-container-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> Overview of Nitrogen Validation </h2>
<div class="outline-text-2" id="text-60">


</div>

<div id="outline-container-60_1" class="outline-3">
<h3 id="sec-60_1"><span class="section-number-3">60.1</span> Validation </h3>
<div class="outline-text-3" id="text-60_1">


</div>

<div id="outline-container-60_1_1" class="outline-4">
<h4 id="sec-60_1_1"><span class="section-number-4">60.1.1</span> Overview of Nitrogen Validation </h4>
<div class="outline-text-4" id="text-60_1_1">


<p>
The simplest validator is the <code>#is_required{}</code> validator. Tell your
<code>login.erl</code> page to make sure the user enters both a username and
a password.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(submit, username, #<span style="color: #28439B;">validate</span> { validators=[
        #<span style="color: #28439B;">is_required</span> { text=<span style="color: #09A240;">"Required."</span> }
    ]}),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(submit, password, #<span style="color: #28439B;">validate</span> { validators=[
        #<span style="color: #28439B;">is_required</span> { text=<span style="color: #09A240;">"Required."</span> }
    ]}),
    #<span style="color: #28439B;">panel</span> { style=<span style="color: #09A240;">"margin: 50px;"</span>, body=[
        ...
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> Overview of Nitrogen Validation </h2>
<div class="outline-text-2" id="text-61">


</div>

<div id="outline-container-61_1" class="outline-3">
<h3 id="sec-61_1"><span class="section-number-3">61.1</span> Validation </h3>
<div class="outline-text-3" id="text-61_1">


</div>

<div id="outline-container-61_1_1" class="outline-4">
<h4 id="sec-61_1_1"><span class="section-number-4">61.1.1</span> Overview of Nitrogen Validation </h4>
<div class="outline-text-4" id="text-61_1_1">


<p>
We can get clever and use a validator to check that the user
entered the correct password. The <code>#custom{}</code> validator runs on
the server. (To make a custom client-side validator, use
<code>#js_custom{}</code>.)
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(submit, username, #<span style="color: #28439B;">validate</span> { validators=[
        #<span style="color: #28439B;">is_required</span> { text=<span style="color: #09A240;">"Required."</span> }
    ]}),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(submit, password, #<span style="color: #28439B;">validate</span> { validators=[
        #<span style="color: #28439B;">is_required</span> { text=<span style="color: #09A240;">"Required."</span> },
        #<span style="color: #28439B;">custom</span> { 
            text=<span style="color: #09A240;">"Invalid password."</span>, 
            function=<span style="color: #FB5D17;">fun</span>(<span style="color: #000000;">_</span>, <span style="color: #000000;">Value</span>) -&gt;<span style="color: #28439B;"> </span><span style="color: #000000;">Value</span> == <span style="color: #09A240;">"password"</span> <span style="color: #FB5D17;">end</span>
        }
    ]}),
    #<span style="color: #28439B;">panel</span> { style=<span style="color: #09A240;">"margin: 50px;"</span>, body=[
        ...
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> Overview of Nitrogen Validation </h2>
<div class="outline-text-2" id="text-62">


</div>

<div id="outline-container-62_1" class="outline-3">
<h3 id="sec-62_1"><span class="section-number-3">62.1</span> Validation </h3>
<div class="outline-text-3" id="text-62_1">


</div>

<div id="outline-container-62_1_1" class="outline-4">
<h4 id="sec-62_1_1"><span class="section-number-4">62.1.1</span> Overview of Nitrogen Validation </h4>
<div class="outline-text-4" id="text-62_1_1">


<p>
Since we validate the password in the <code>#custom</code> validator, we can
trust that the <code>login</code> event only fires when the password is
correct. Change the <code>login</code> event to:
</p>



<pre class="src src-erlang"><span style="color: #28439B;">event</span>(login) -&gt;
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">role</span>(managers, true),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">redirect_from_login</span>(<span style="color: #09A240;">"/"</span>).
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> PART 9 AGENDA </h2>
<div class="outline-text-2" id="text-63">


</div>

<div id="outline-container-63_1" class="outline-3">
<h3 id="sec-63_1"><span class="section-number-3">63.1</span> Comet </h3>
<div class="outline-text-3" id="text-63_1">

<ul>
<li>
What is Comet?
</li>
<li>
Comet the Nitrogen/Erlang Way
</li>
<li>
A Comet Counter
</li>
<li>
Comet Pools
</li>
<li>
Comet Pool Scope
</li>
<li>
The Simplest Chatroom Ever Constructed

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-64" class="outline-2">
<h2 id="sec-64"><span class="section-number-2">64</span> What is Comet? </h2>
<div class="outline-text-2" id="text-64">


</div>

<div id="outline-container-64_1" class="outline-3">
<h3 id="sec-64_1"><span class="section-number-3">64.1</span> Comet </h3>
<div class="outline-text-3" id="text-64_1">


</div>

<div id="outline-container-64_1_1" class="outline-4">
<h4 id="sec-64_1_1"><span class="section-number-4">64.1.1</span> What is Comet? </h4>
<div class="outline-text-4" id="text-64_1_1">


<p>
<b>Comet</b> is the name for a technique where the browser requests
something from the server, and the server doesn't respond until
it has something useful to say.
</p>
<p>
This makes it useful for applications that need fast, out-of-band
communication, such as chat rooms. 
</p>
<p>
In other words, you don't need to keep hitting a "Get Messages"
button. The server just pushes messages when they are available.
</p>
<p>
<i>A big happy shout out to Tom McNulty for his innovative ideas on what     Comet support could look like in Nitrogen.</i>
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-65" class="outline-2">
<h2 id="sec-65"><span class="section-number-2">65</span> Comet the Nitrogen/Erlang Way </h2>
<div class="outline-text-2" id="text-65">


</div>

<div id="outline-container-65_1" class="outline-3">
<h3 id="sec-65_1"><span class="section-number-3">65.1</span> Comet </h3>
<div class="outline-text-3" id="text-65_1">


</div>

<div id="outline-container-65_1_1" class="outline-4">
<h4 id="sec-65_1_1"><span class="section-number-4">65.1.1</span> Comet the Nitrogen/Erlang Way </h4>
<div class="outline-text-4" id="text-65_1_1">


<p>
Think of Comet like <code>erlang:spawn/1</code>:
</p>
<ul>
<li>
Start up a function.

</li>
<li>
The function can manipulate the page using <code>wf:update/2</code> or any
other page manipulation function.

</li>
<li>
Output is queued until the function ends or calls <code>wf:flush/0</code>.

</li>
<li>
The function acts like it is linked to the current user's
page. It is killed when the user leaves the page (or receives
<code>{'EXIT', _, Message}</code> if <code>trap_exit</code> is <code>true</code>.)

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-66" class="outline-2">
<h2 id="sec-66"><span class="section-number-2">66</span> A Comet Counter </h2>
<div class="outline-text-2" id="text-66">


</div>

<div id="outline-container-66_1" class="outline-3">
<h3 id="sec-66_1"><span class="section-number-3">66.1</span> Comet </h3>
<div class="outline-text-3" id="text-66_1">


</div>

<div id="outline-container-66_1_1" class="outline-4">
<h4 id="sec-66_1_1"><span class="section-number-4">66.1.1</span> A Comet Counter </h4>
<div class="outline-text-4" id="text-66_1_1">


<p>
Update <code>my_page.erl</code> to count once per second.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">comet</span>(<span style="color: #FB5D17;">fun</span>() -&gt;<span style="color: #28439B;"> </span><span style="color: #28439B;">counter</span>(1) <span style="color: #FB5D17;">end</span>),
    #<span style="color: #28439B;">panel</span> { id=placeholder }.

<span style="color: #28439B;">counter</span>(<span style="color: #000000;">Count</span>) -&gt;
    <span style="color: #28439B;">timer</span>:<span style="color: #28439B;">sleep</span>(1000),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">update</span>(placeholder, <span style="color: #000000;">integer_to_list</span>(<span style="color: #000000;">Count</span>)),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">flush</span>(),
    <span style="color: #28439B;">counter</span>(<span style="color: #000000;">Count</span> + 1).
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-67" class="outline-2">
<h2 id="sec-67"><span class="section-number-2">67</span> Comet Pools </h2>
<div class="outline-text-2" id="text-67">


</div>

<div id="outline-container-67_1" class="outline-3">
<h3 id="sec-67_1"><span class="section-number-3">67.1</span> Comet </h3>
<div class="outline-text-3" id="text-67_1">


</div>

<div id="outline-container-67_1_1" class="outline-4">
<h4 id="sec-67_1_1"><span class="section-number-4">67.1.1</span> Comet Pools </h4>
<div class="outline-text-4" id="text-67_1_1">


<p>
You can tell a Comet function to start in a pool by providing a
<code>PoolName</code>. The <code>PoolName</code> can be any Erlang term.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">comet</span>(<span style="color: #000000;">Fun</span>, <span style="color: #000000;">PoolName</span>)
</pre>



<p>
Now you can send messages to the pool. The messages will be
received by other functions started in that comet pool.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">send</span>(<span style="color: #000000;">PoolName</span>, <span style="color: #000000;">Message</span>)
</pre>



</div>
</div>
</div>

</div>
