doc/org-mode/tutorial.org
*** Comet Pool Scope

    So far, we've been creating *local* comet pools. Nitrogen also has
    the idea of *global* comet pools:

    + *Local* comet pools are walled around the current page and the
      current user. If the user reloads the page, the comet process(es)
      goes away.

    + *Global* comet pools exist to help you create multi-user
      applications. They pool is accessible by *all* pages and *all*
      users.

    #+BEGIN_SRC erlang
    %% Create a global comet pool.
    wf:comet_global(Function, PoolName)
    
    %% Send a global comet message.
    wf:send_global(PoolName, Message)
    #+END_SRC

* The Simplest Chatroom Ever Constructed
** Comet
*** The Simplest Chatroom Ever Constructed

    Here we're going to create a page that listens for some text, and
    sends it to the global comet pool. Connect with different browsers
    and chat to yourself.
    
    #+BEGIN_SRC erlang
    body() -> 
        wf:comet_global(fun() -> repeater() end, repeater_pool),
        [
            #textbox { id=msg, text="Your message...", next=submit },
            #button { id=submit, text="Submit", postback=submit },
            #panel { id=placeholder }
        ].
     
    event(submit) ->
        ?PRINT(wf:q(msg)),
        wf:send_global(repeater_pool, {msg, wf:q(msg)}).
     
    repeater() ->
        receive 
            {msg, Msg} -> wf:insert_top(placeholder, [Msg, "<br>"])
        end,
        wf:flush(),
        repeater().
    #+END_SRC

* PART 10 AGENDA
** Extending Nitrogen
   + Custom Elements
   + Custom Actions
   + Handlers
* Custom Elements - Part 1
** Extending Nitrogen
*** Custom Elements - Part 1
    
    You can create custom elements to encapsulate other
    elements. There is no difference between a *custom* element and a
    *built-in* element, except where the actual files are stored.

    Create a new custom element in =site/src/elements/my_element.erl=.

    : ./bin/dev element my_element
    
* Custom Elements - Part 2
** Extending Nitrogen
*** Custom Elements - Part 2
    
    An element has:
    
    1. A *record* containing the properties of the element.

    2. A =reflect()= function, providing a programattic way to get the
       properties of an element. If =record_info(fields, RecordType)=
       worked, this would not be necessary.)

    3. A =render_element(Record)= function that emits HTML or
       other elements.
    
* Custom Elements - Part 3
** Extending Nitrogen
*** Custom Elements - Part 3
    
    Let's make an element that displays a textbox and a button, logs
    the result of the textbox to the console, and then calls a method
    on the main page.

    #+BEGIN_SRC erlang
    render_element(#my_element{}) ->
        TextboxID = wf:temp_id(),
        ButtonID = wf:temp_id(),
        wf:wire(ButtonID, #event { 
            type=click,
            delegate=?MODULE, 
            postback={click, TextboxID}
        }),
        [
            #textbox { id=TextboxID, text="Your text...", next=ButtonID },
            #button { id=ButtonID, text="Submit" }
        ].
     
    event({click, TextboxID}) ->
        Text = wf:q(TextboxID),
        ?PRINT({clicked, TextboxID, Text}),
        PageModule = wf:page_module(),
        PageModule:my_element_event(Text).
    #+END_SRC
* Custom Elements - Part 4
** Extending Nitrogen
*** Custom Elements - Part 4

    Now, use the element on =my_page.erl=. Remember to move the
    element into =include/records.hrl= first!

    #+BEGIN_SRC erlang
    body() -> 
        #my_element {}.
     
    my_element_event(Text) ->
        ?PRINT(Text).
    #+END_SRC


    /For more examples, see the built-in elements under
    nitrogen/src/elements./

* Custom Actions - Part 1
** Extending Nitrogen
*** Custom Actions - Part 1

    A custom *action* is like a custom *element*, except it should
    emit Javascript or other actions.

    : ./bin/dev action my_action

* Custom Actions - Part 2
** Extending Nitrogen
