doc/org-mode/tutorial.html

<div id="outline-container-68" class="outline-2">
<h2 id="sec-68"><span class="section-number-2">68</span> Comet Pool Scope </h2>
<div class="outline-text-2" id="text-68">


</div>

<div id="outline-container-68_1" class="outline-3">
<h3 id="sec-68_1"><span class="section-number-3">68.1</span> Comet </h3>
<div class="outline-text-3" id="text-68_1">


</div>

<div id="outline-container-68_1_1" class="outline-4">
<h4 id="sec-68_1_1"><span class="section-number-4">68.1.1</span> Comet Pool Scope </h4>
<div class="outline-text-4" id="text-68_1_1">


<p>
So far, we've been creating <b>local</b> comet pools. Nitrogen also has
the idea of <b>global</b> comet pools:
</p>
<ul>
<li>
<b>Local</b> comet pools are walled around the current page and the
current user. If the user reloads the page, the comet process(es)
goes away.

</li>
<li>
<b>Global</b> comet pools exist to help you create multi-user
applications. They pool is accessible by <b>all</b> pages and <b>all</b>
users.


</li>
</ul>


<pre class="src src-erlang"><span style="color: #929292;">%% </span><span style="color: #929292;">Create a global comet pool.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">comet_global</span>(<span style="color: #000000;">Function</span>, <span style="color: #000000;">PoolName</span>)

<span style="color: #929292;">%% </span><span style="color: #929292;">Send a global comet message.
</span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">send_global</span>(<span style="color: #000000;">PoolName</span>, <span style="color: #000000;">Message</span>)
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-69" class="outline-2">
<h2 id="sec-69"><span class="section-number-2">69</span> The Simplest Chatroom Ever Constructed </h2>
<div class="outline-text-2" id="text-69">


</div>

<div id="outline-container-69_1" class="outline-3">
<h3 id="sec-69_1"><span class="section-number-3">69.1</span> Comet </h3>
<div class="outline-text-3" id="text-69_1">


</div>

<div id="outline-container-69_1_1" class="outline-4">
<h4 id="sec-69_1_1"><span class="section-number-4">69.1.1</span> The Simplest Chatroom Ever Constructed </h4>
<div class="outline-text-4" id="text-69_1_1">


<p>
Here we're going to create a page that listens for some text, and
sends it to the global comet pool. Connect with different browsers
and chat to yourself.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">comet_global</span>(<span style="color: #FB5D17;">fun</span>() -&gt;<span style="color: #28439B;"> </span><span style="color: #28439B;">repeater</span>() <span style="color: #FB5D17;">end</span>, repeater_pool),
    [
        #<span style="color: #28439B;">textbox</span> { id=msg, text=<span style="color: #09A240;">"Your message..."</span>, next=submit },
        #<span style="color: #28439B;">button</span> { id=submit, text=<span style="color: #09A240;">"Submit"</span>, postback=submit },
        #<span style="color: #28439B;">panel</span> { id=placeholder }
    ].

<span style="color: #28439B;">event</span>(submit) -&gt;
    ?<span style="color: #28439B;">PRINT</span>(<span style="color: #28439B;">wf</span>:<span style="color: #28439B;">q</span>(msg)),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">send_global</span>(repeater_pool, {msg, <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">q</span>(msg)}).

<span style="color: #28439B;">repeater</span>() -&gt;
    <span style="color: #FB5D17;">receive</span> 
        {msg, <span style="color: #000000;">Msg</span>} -&gt;<span style="color: #28439B;"> </span><span style="color: #28439B;">wf</span>:<span style="color: #28439B;">insert_top</span>(placeholder, [<span style="color: #000000;">Msg</span>, <span style="color: #09A240;">"&lt;br&gt;"</span>])
    <span style="color: #FB5D17;">end</span>,
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">flush</span>(),
    <span style="color: #28439B;">repeater</span>().
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-70" class="outline-2">
<h2 id="sec-70"><span class="section-number-2">70</span> PART 10 AGENDA </h2>
<div class="outline-text-2" id="text-70">


</div>

<div id="outline-container-70_1" class="outline-3">
<h3 id="sec-70_1"><span class="section-number-3">70.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-70_1">

<ul>
<li>
Custom Elements
</li>
<li>
Custom Actions
</li>
<li>
Handlers
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-71" class="outline-2">
<h2 id="sec-71"><span class="section-number-2">71</span> Custom Elements - Part 1 </h2>
<div class="outline-text-2" id="text-71">


</div>

<div id="outline-container-71_1" class="outline-3">
<h3 id="sec-71_1"><span class="section-number-3">71.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-71_1">


</div>

<div id="outline-container-71_1_1" class="outline-4">
<h4 id="sec-71_1_1"><span class="section-number-4">71.1.1</span> Custom Elements - Part 1 </h4>
<div class="outline-text-4" id="text-71_1_1">


<p>
You can create custom elements to encapsulate other
elements. There is no difference between a <b>custom</b> element and a
<b>built-in</b> element, except where the actual files are stored.
</p>
<p>
Create a new custom element in <code>site/src/elements/my_element.erl</code>.
</p>
<pre class="example">
./bin/dev element my_element
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-72" class="outline-2">
<h2 id="sec-72"><span class="section-number-2">72</span> Custom Elements - Part 2 </h2>
<div class="outline-text-2" id="text-72">


</div>

<div id="outline-container-72_1" class="outline-3">
<h3 id="sec-72_1"><span class="section-number-3">72.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-72_1">


</div>

<div id="outline-container-72_1_1" class="outline-4">
<h4 id="sec-72_1_1"><span class="section-number-4">72.1.1</span> Custom Elements - Part 2 </h4>
<div class="outline-text-4" id="text-72_1_1">


<p>
An element has:
</p>
<ol>
<li>
A <b>record</b> containing the properties of the element.

</li>
<li>
A <code>reflect()</code> function, providing a programattic way to get the
properties of an element. If <code>record_info(fields, RecordType)</code>
worked, this would not be necessary.)

</li>
<li>
A <code>render_element(Record)</code> function that emits HTML or
other elements.

</li>
</ol>
</div>
</div>
</div>

</div>

<div id="outline-container-73" class="outline-2">
<h2 id="sec-73"><span class="section-number-2">73</span> Custom Elements - Part 3 </h2>
<div class="outline-text-2" id="text-73">


</div>

<div id="outline-container-73_1" class="outline-3">
<h3 id="sec-73_1"><span class="section-number-3">73.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-73_1">


</div>

<div id="outline-container-73_1_1" class="outline-4">
<h4 id="sec-73_1_1"><span class="section-number-4">73.1.1</span> Custom Elements - Part 3 </h4>
<div class="outline-text-4" id="text-73_1_1">


<p>
Let's make an element that displays a textbox and a button, logs
the result of the textbox to the console, and then calls a method
on the main page.
</p>



<pre class="src src-erlang"><span style="color: #28439B;">render_element</span>(#<span style="color: #28439B;">my_element</span>{}) -&gt;
    <span style="color: #000000;">TextboxID</span> = <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">temp_id</span>(),
    <span style="color: #000000;">ButtonID</span> = <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">temp_id</span>(),
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(<span style="color: #000000;">ButtonID</span>, #<span style="color: #28439B;">event</span> { 
        type=click,
        delegate=?<span style="color: #28439B;">MODULE</span>, 
        postback={click, <span style="color: #000000;">TextboxID</span>}
    }),
    [
        #<span style="color: #28439B;">textbox</span> { id=<span style="color: #000000;">TextboxID</span>, text=<span style="color: #09A240;">"Your text..."</span>, next=<span style="color: #000000;">ButtonID</span> },
        #<span style="color: #28439B;">button</span> { id=<span style="color: #000000;">ButtonID</span>, text=<span style="color: #09A240;">"Submit"</span> }
    ].

<span style="color: #28439B;">event</span>({click, <span style="color: #000000;">TextboxID</span>}) -&gt;
    <span style="color: #000000;">Text</span> = <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">q</span>(<span style="color: #000000;">TextboxID</span>),
    ?<span style="color: #28439B;">PRINT</span>({clicked, <span style="color: #000000;">TextboxID</span>, <span style="color: #000000;">Text</span>}),
    <span style="color: #000000;">PageModule</span> = <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">page_module</span>(),
    <span style="color: #000000;">PageModule</span>:<span style="color: #28439B;">my_element_event</span>(<span style="color: #000000;">Text</span>).
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-74" class="outline-2">
<h2 id="sec-74"><span class="section-number-2">74</span> Custom Elements - Part 4 </h2>
<div class="outline-text-2" id="text-74">


</div>

<div id="outline-container-74_1" class="outline-3">
<h3 id="sec-74_1"><span class="section-number-3">74.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-74_1">


</div>

<div id="outline-container-74_1_1" class="outline-4">
<h4 id="sec-74_1_1"><span class="section-number-4">74.1.1</span> Custom Elements - Part 4 </h4>
<div class="outline-text-4" id="text-74_1_1">


<p>
Now, use the element on <code>my_page.erl</code>. Remember to move the
element into <code>include/records.hrl</code> first!
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    #<span style="color: #28439B;">my_element</span> {}.

<span style="color: #28439B;">my_element_event</span>(<span style="color: #000000;">Text</span>) -&gt;
    ?<span style="color: #28439B;">PRINT</span>(<span style="color: #000000;">Text</span>).
</pre>




<p>
<i>For more examples, see the built-in elements under     nitrogen/src/elements.</i>
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-75" class="outline-2">
<h2 id="sec-75"><span class="section-number-2">75</span> Custom Actions - Part 1 </h2>
<div class="outline-text-2" id="text-75">


</div>

<div id="outline-container-75_1" class="outline-3">
<h3 id="sec-75_1"><span class="section-number-3">75.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-75_1">


</div>

<div id="outline-container-75_1_1" class="outline-4">
<h4 id="sec-75_1_1"><span class="section-number-4">75.1.1</span> Custom Actions - Part 1 </h4>
<div class="outline-text-4" id="text-75_1_1">


<p>
A custom <b>action</b> is like a custom <b>element</b>, except it should
emit Javascript or other actions.
</p>
<pre class="example">
./bin/dev action my_action
</pre>


</div>
</div>
</div>

</div>
