doc/org-mode/tutorial.org
*** Custom Actions - Part 2

    Let's make a custom action that calls =#alert{}= with a specified
    string, but converted to all uppercase.

    #+BEGIN_SRC erlang
    -record(my_action, {?ACTION_BASE(action_my_action), text}).
     
    render_action(Record = #my_action{}) ->
        #alert { text=string:to_upper(Record#my_action.text) }.
    #+END_SRC
* Custom Actions - Part 3
** Extending Nitrogen
*** Custom Actions - Part 3

    Now, use the element on =my_page.erl=. Remember to move the action
    into =include/records.hrl= first!

    #+BEGIN_SRC erlang
    body() -> 
        wf:wire(#my_action { text="this is a message" }),
        #label { text="You should see an alert." }.
    #+END_SRC

    /For more examples, see the built-in actions under
    nitrogen/src/actions./

* Handlers - Part 1
** Extending Nitrogen
*** Handlers - Part 1

    Handlers are an attempt to formalize an approach for overriding
    core Nitrogen behavior.

    Handlers exist for:
    + Configuration
    + Logging
    + Process Registry
    + Caching
    + Session Storage
    + Page State Storage
    + User Identity
    + Roles
    + Routing
    + Security
    
* Handlers - Part 2
** Extending Nitrogen
*** Handlers - Part 2
    
    Handlers are initialized in the order described on the previous
    page. This means that any handler can access and override
    information defined by a handler that came before it. 

    For example, you could write a =route_handler= that behaved
    differently depending on the role of a user.
* Handlers - Part 3
** Extending Nitrogen
*** Handlers - Part 3

    Let's make a =security_handler= handler that only allows the user
    to access modules beginning with the word "my".

    #+BEGIN_SRC erlang
    -module(my_security_handler).
    -behaviour(security_handler).
    -export([init/2, finish/2]).
    -include_lib("nitrogen/include/wf.hrl").
     
    init(_Config, State) ->
        ?PRINT(wf:page_module()),
        case wf:to_list(wf:page_module()) of
            "my" ++ _ ->
                {ok, State};
            "static_file" ->
                {ok, State};
            _ ->
                wf_context:page_module(access_denied),
                {ok, State}
        end.
     
    finish(_Config, State) ->
        {ok, State}.
    #+END_SRC

* Handlers - Part 3
** Extending Nitrogen
*** Handlers - Part 3

    Now, install the handler in =nitrogen_inets.erl=:

    #+BEGIN_SRC erlang
    do(Info) ->
	RequestBridge = simple_bridge:make_request(inets_request_bridge, Info),
	ResponseBridge = simple_bridge:make_response(inets_response_bridge, Info),
	nitrogen:init_request(RequestBridge, ResponseBridge),
        nitrogen:handler(my_security_handler, []),
	nitrogen:run().
    #+END_SRC

* Conclusion
** Conclusion
  By now, you should have a basic understanding of how Nitrogen works,
  and know enough to be able to quickly grok the examples on
  [[http://nitrogenproject.com]] and apply them to your own pages.
  
  Things not covered in this tutorial:

  + Drag and Drop
  + Sorting
  + Binding
  + More Effects
  + File Uploads
  + Javascript API
  + Custom Valiators
  + Handlers

* Conclusion
** Thanks

   + Mailing List, Bugs, etc: [[http://nitrogenproject.com/community]]
   + Follow me on Twitter: [[http://twitter/rklophaus][@rklophaus]]
