doc/org-mode/tutorial.html

<div id="outline-container-76" class="outline-2">
<h2 id="sec-76"><span class="section-number-2">76</span> Custom Actions - Part 2 </h2>
<div class="outline-text-2" id="text-76">


</div>

<div id="outline-container-76_1" class="outline-3">
<h3 id="sec-76_1"><span class="section-number-3">76.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-76_1">


</div>

<div id="outline-container-76_1_1" class="outline-4">
<h4 id="sec-76_1_1"><span class="section-number-4">76.1.1</span> Custom Actions - Part 2 </h4>
<div class="outline-text-4" id="text-76_1_1">


<p>
Let's make a custom action that calls <code>#alert{}</code> with a specified
string, but converted to all uppercase.
</p>



<pre class="src src-erlang"><span style="color: #FB5D17;">-record</span>(<span style="color: #28439B;">my_action</span>, {?<span style="color: #28439B;">ACTION_BASE</span>(action_my_action), text}).

<span style="color: #28439B;">render_action</span>(<span style="color: #000000;">Record</span> = #<span style="color: #28439B;">my_action</span>{}) -&gt;
    #<span style="color: #28439B;">alert</span> { text=<span style="color: #28439B;">string</span>:<span style="color: #28439B;">to_upper</span>(<span style="color: #000000;">Record</span>#<span style="color: #28439B;">my_action</span>.text) }.
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-77" class="outline-2">
<h2 id="sec-77"><span class="section-number-2">77</span> Custom Actions - Part 3 </h2>
<div class="outline-text-2" id="text-77">


</div>

<div id="outline-container-77_1" class="outline-3">
<h3 id="sec-77_1"><span class="section-number-3">77.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-77_1">


</div>

<div id="outline-container-77_1_1" class="outline-4">
<h4 id="sec-77_1_1"><span class="section-number-4">77.1.1</span> Custom Actions - Part 3 </h4>
<div class="outline-text-4" id="text-77_1_1">


<p>
Now, use the element on <code>my_page.erl</code>. Remember to move the action
into <code>include/records.hrl</code> first!
</p>



<pre class="src src-erlang"><span style="color: #28439B;">body</span>() -&gt;<span style="color: #28439B;"> </span>
    <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">wire</span>(#<span style="color: #28439B;">my_action</span> { text=<span style="color: #09A240;">"this is a message"</span> }),
    #<span style="color: #28439B;">label</span> { text=<span style="color: #09A240;">"You should see an alert."</span> }.
</pre>



<p>
<i>For more examples, see the built-in actions under     nitrogen/src/actions.</i>
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-78" class="outline-2">
<h2 id="sec-78"><span class="section-number-2">78</span> Handlers - Part 1 </h2>
<div class="outline-text-2" id="text-78">


</div>

<div id="outline-container-78_1" class="outline-3">
<h3 id="sec-78_1"><span class="section-number-3">78.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-78_1">


</div>

<div id="outline-container-78_1_1" class="outline-4">
<h4 id="sec-78_1_1"><span class="section-number-4">78.1.1</span> Handlers - Part 1 </h4>
<div class="outline-text-4" id="text-78_1_1">


<p>
Handlers are an attempt to formalize an approach for overriding
core Nitrogen behavior.
</p>
<p>
Handlers exist for:
</p><ul>
<li>
Configuration
</li>
<li>
Logging
</li>
<li>
Process Registry
</li>
<li>
Caching
</li>
<li>
Session Storage
</li>
<li>
Page State Storage
</li>
<li>
User Identity
</li>
<li>
Roles
</li>
<li>
Routing
</li>
<li>
Security

</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-79" class="outline-2">
<h2 id="sec-79"><span class="section-number-2">79</span> Handlers - Part 2 </h2>
<div class="outline-text-2" id="text-79">


</div>

<div id="outline-container-79_1" class="outline-3">
<h3 id="sec-79_1"><span class="section-number-3">79.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-79_1">


</div>

<div id="outline-container-79_1_1" class="outline-4">
<h4 id="sec-79_1_1"><span class="section-number-4">79.1.1</span> Handlers - Part 2 </h4>
<div class="outline-text-4" id="text-79_1_1">


<p>
Handlers are initialized in the order described on the previous
page. This means that any handler can access and override
information defined by a handler that came before it. 
</p>
<p>
For example, you could write a <code>route_handler</code> that behaved
differently depending on the role of a user.
</p></div>
</div>
</div>

</div>

<div id="outline-container-80" class="outline-2">
<h2 id="sec-80"><span class="section-number-2">80</span> Handlers - Part 3 </h2>
<div class="outline-text-2" id="text-80">


</div>

<div id="outline-container-80_1" class="outline-3">
<h3 id="sec-80_1"><span class="section-number-3">80.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-80_1">


</div>

<div id="outline-container-80_1_1" class="outline-4">
<h4 id="sec-80_1_1"><span class="section-number-4">80.1.1</span> Handlers - Part 3 </h4>
<div class="outline-text-4" id="text-80_1_1">


<p>
Let's make a <code>security_handler</code> handler that only allows the user
to access modules beginning with the word "my".
</p>



<pre class="src src-erlang"><span style="color: #FB5D17;">-module</span>(my_security_handler).
<span style="color: #FB5D17;">-behaviour</span>(security_handler).
<span style="color: #FB5D17;">-export</span>([<span style="color: #28439B;">init/2</span>, <span style="color: #28439B;">finish/2</span>]).
<span style="color: #FB5D17;">-include_lib</span>(<span style="color: #09A240;">"nitrogen/include/wf.hrl"</span>).

<span style="color: #28439B;">init</span>(<span style="color: #000000;">_Config</span>, <span style="color: #000000;">State</span>) -&gt;
    ?<span style="color: #28439B;">PRINT</span>(<span style="color: #28439B;">wf</span>:<span style="color: #28439B;">page_module</span>()),
    <span style="color: #FB5D17;">case</span> <span style="color: #28439B;">wf</span>:<span style="color: #28439B;">to_list</span>(<span style="color: #28439B;">wf</span>:<span style="color: #28439B;">page_module</span>()) <span style="color: #FB5D17;">of</span>
        <span style="color: #09A240;">"my"</span> ++ <span style="color: #000000;">_</span> -&gt;
            {ok, <span style="color: #000000;">State</span>};
        <span style="color: #09A240;">"static_file"</span> -&gt;
            {ok, <span style="color: #000000;">State</span>};
        <span style="color: #000000;">_</span> -&gt;
            <span style="color: #28439B;">wf_context</span>:<span style="color: #28439B;">page_module</span>(access_denied),
            {ok, <span style="color: #000000;">State</span>}
    <span style="color: #FB5D17;">end</span>.

<span style="color: #28439B;">finish</span>(<span style="color: #000000;">_Config</span>, <span style="color: #000000;">State</span>) -&gt;
    {ok, <span style="color: #000000;">State</span>}.
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-81" class="outline-2">
<h2 id="sec-81"><span class="section-number-2">81</span> Handlers - Part 3 </h2>
<div class="outline-text-2" id="text-81">


</div>

<div id="outline-container-81_1" class="outline-3">
<h3 id="sec-81_1"><span class="section-number-3">81.1</span> Extending Nitrogen </h3>
<div class="outline-text-3" id="text-81_1">


</div>

<div id="outline-container-81_1_1" class="outline-4">
<h4 id="sec-81_1_1"><span class="section-number-4">81.1.1</span> Handlers - Part 3 </h4>
<div class="outline-text-4" id="text-81_1_1">


<p>
Now, install the handler in <code>nitrogen_inets.erl</code>:
</p>



<pre class="src src-erlang"><span style="color: #28439B;">do</span>(<span style="color: #000000;">Info</span>) -&gt;
    <span style="color: #000000;">RequestBridge</span> = <span style="color: #28439B;">simple_bridge</span>:<span style="color: #28439B;">make_request</span>(inets_request_bridge, <span style="color: #000000;">Info</span>),
    <span style="color: #000000;">ResponseBridge</span> = <span style="color: #28439B;">simple_bridge</span>:<span style="color: #28439B;">make_response</span>(inets_response_bridge, <span style="color: #000000;">Info</span>),
    <span style="color: #28439B;">nitrogen</span>:<span style="color: #28439B;">init_request</span>(<span style="color: #000000;">RequestBridge</span>, <span style="color: #000000;">ResponseBridge</span>),
    <span style="color: #28439B;">nitrogen</span>:<span style="color: #28439B;">handler</span>(my_security_handler, []),
    <span style="color: #28439B;">nitrogen</span>:<span style="color: #28439B;">run</span>().
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-82" class="outline-2">
<h2 id="sec-82"><span class="section-number-2">82</span> Conclusion </h2>
<div class="outline-text-2" id="text-82">


</div>

<div id="outline-container-82_1" class="outline-3">
<h3 id="sec-82_1"><span class="section-number-3">82.1</span> Conclusion </h3>
<div class="outline-text-3" id="text-82_1">

<p>By now, you should have a basic understanding of how Nitrogen works,
and know enough to be able to quickly grok the examples on
<a href="http://nitrogenproject.com">http://nitrogenproject.com</a> and apply them to your own pages.
</p>
<p>
Things not covered in this tutorial:
</p>
<ul>
<li>
Drag and Drop
</li>
<li>
Sorting
</li>
<li>
Binding
</li>
<li>
More Effects
</li>
<li>
File Uploads
</li>
<li>
Javascript API
</li>
<li>
Custom Valiators
</li>
<li>
Handlers

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-83" class="outline-2">
<h2 id="sec-83"><span class="section-number-2">83</span> Conclusion </h2>
<div class="outline-text-2" id="text-83">


</div>

<div id="outline-container-83_1" class="outline-3">
<h3 id="sec-83_1"><span class="section-number-3">83.1</span> Thanks </h3>
<div class="outline-text-3" id="text-83_1">


<ul>
<li>
Mailing List, Bugs, etc: <a href="http://nitrogenproject.com/community">http://nitrogenproject.com/community</a>
</li>
<li>
Follow me on Twitter: <a href="http://twitter/rklophaus">@rklophaus</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Rusty Klophaus
</p>
<p class="date"> Date: 2010-12-06 08:54:01 EST</p>
<p class="creator">HTML generated by org-mode 7.01h in emacs 24</p>
</div>
</div>
</body>
</html>
